{
    "find me my balance now": "balance", 
    "how much money do I have in my bank account today?": "balance", 
    "tell me how much cash I have.": "balance", 
    "what is my financial status today?": "balance", 
    "what's the deal with my money today?": "balance", 
    "Toronto spending": "history", 
    "ATM in my area.": "location", 
    "About how much did I spend in Portland?": "history", 
    "About how much have my last five transactions cost?": "txnlist", 
    "I spent how much when I was in Chicago": "history", 
    "Am I able to afford a pizza for $15": "spendadvice", 
    "Am I able to purchase this dress": "spendadvice", 
    "Am I broke?": "balance", 
    "Am I getting paid this week or next?": "payday", 
    "Am I near a bank or ATM?": "location", 
    "Am I near an ATM?": "location", 
    "Any ATMs in my area?": "location", 
    "Are there any drive up ATM machines nearby?": "location", 
    "As of noon, what is my account balance?": "balance", 
    "Ask Siri about my account balance?": "balance", 
    "Bank open close to me.": "location", 
    "Bank or ATM in my area.": "location", 
    "Between July 1 & September 1, how much money was added to my account?": "income", 
    "CAN YOU MOVE $500 FROM THE SAVINGS ACCOUNT TO THE CHECKING ACCOUNT?": "transfer", 
    "CAN YOU OPEN MY SAVINGS BALANCE AND THEN TRANSFER $500 TO MY CHECKING?": "transfer", 
    "CAN YOU SHIFT $500 FROM THE SAVINGS TO CHECKING?": "transfer", 
    "CAN YOU SHOW ME A LIST OF TRANSACTIONS FILTERED BY COST HIGHEST TO LOWEST?": "txnlist", 
    "CAN YOU SHOW ME A LIST OF TRANSACTIONS FILTERED BY COST LOWEST TO HIGHEST?": "txnlist", 
    "CAN YOU SHOW ME A LIST OF TRANSACTIONS FILTERED BY LOCATION OF STORE?": "txnlist", 
    "CAN YOU SHOW ME A LIST OF TRANSACTIONS FILTERED BY THE DATE?": "txnlist", 
    "CAN YOU SHOW ME A LIST OF TRANSACTIONS FILTERED BY THE TYPE OF TRANSACTION?": "txnlist", 
    "CAN YOU TRANSFER $500 FROM MY SAVINGS TO CHECKING?": "transfer", 
    "CHECK ACCOUNT BALANCE": "balance", 
    "Calculate my earnings for this year?": "income", 
    "Can I afford $12.33 in gas?": "spendadvice", 
    "Can I afford $2 for carrots?": "spendadvice", 
    "Can I afford new skis?": "spendadvice", 
    "Can I afford a $30 scarf?": "spendadvice", 
    "Can I afford a $75 hotel room?": "spendadvice", 
    "Can I afford these new jeans right now?": "spendadvice", 
    "Can I afford this $5 cup of coffee?": "spendadvice", 
    "Can I afford this t-shirt": "spendadvice", 
    "Can I afford to buy a camera?": "spendadvice", 
    "Can I afford to buy a house?": "spendadvice", 
    "Can I afford to buy new shoes?": "spendadvice", 
    "Can I afford to make my $100 phone payment": "spendadvice", 
    "Can I afford to spend $100 on a purse out of my budget?": "spendadvice", 
    "Can I buy $10 of gas?": "spendadvice", 
    "Can I buy $25 worth of spices": "spendadvice", 
    "Can I buy $350 worth of phones?": "spendadvice", 
    "Can I buy a $14,000 car?": "spendadvice", 
    "Can I buy a $325 plane ticket?": "spendadvice", 
    "Can I buy a 52 inch flatscreen TV for $500 at Best Buy?": "spendadvice", 
    "Can I buy a car": "spendadvice", 
    "Can I buy drinks for 100 bucks in the club tonight?": "spendadvice", 
    "Can I buy that pair of shoes for 100.00?": "spendadvice", 
    "Can I buy the new phone I want?": "spendadvice", 
    "Can I go out to eat at shalimar if I only spend $15?": "spendadvice", 
    "Can I have a breakdown of my spending?": "history", 
    "Can I make a deposit at the closest ATM to my house?": "location", 
    "Can I make a transfer from my checking account to my savings account?": "transfer", 
    "Can I pay 100 dollars for the concert tonight?": "spendadvice", 
    "Can I purchase a Toyota Camry for $10,000?": "spendadvice", 
    "Can I see my transactions from last week?": "txnlist", 
    "Can I send some money to my friend from my bank account through Paypal?": "transfer", 
    "Can I spend $10 on gas?": "spendadvice", 
    "Can I spend $100 at Target?": "spendadvice", 
    "Can I spend $100 at the races?": "spendadvice", 
    "Can I spend $100 on a hair cut?": "spendadvice", 
    "Can I spend $120 on a pair of shoes?": "spendadvice", 
    "Can I spend $20 dollars on that new top?": "spendadvice", 
    "Can I spend $20 on dinner tomorrow?": "spendadvice", 
    "Can I spend $20 on food this week?": "spendadvice", 
    "Can I spend $20 on lunch today?": "spendadvice", 
    "Can I spend $20 on movie tickets?": "spendadvice", 
    "Can I spend $25 on dinner?": "spendadvice", 
    "Can I spend $25 on this steak?": "spendadvice", 
    "Can I spend $30 at the movies?": "spendadvice", 
    "Can I spend $345 on a poodle?": "spendadvice", 
    "Can I spend $40 to fill up my car?": "spendadvice", 
    "Can I spend $5,000 on a Vespa?": "spendadvice", 
    "Can I spend $50 on a dress?": "spendadvice", 
    "Can I spend $50 on a new watch?": "spendadvice", 
    "Can I spend $50 on clothing?": "spendadvice", 
    "Can I spend $50 on food?": "spendadvice", 
    "Can I spend $50 on shoes": "spendadvice", 
    "Can I spend $50 on this purse?": "spendadvice", 
    "Can I spend $50 to fill up the car?": "spendadvice", 
    "Can I spend $500 on auto repairs": "spendadvice", 
    "Can I spend $600 on a new phone right now?": "spendadvice", 
    "Can I spend an amount of money on clothes?": "spendadvice", 
    "Can I spend any money on tickets": "spendadvice", 
    "Can I spend fifty dollars at the movie theater?": "spendadvice", 
    "Can I spend fifty dollars in Kmart?": "spendadvice", 
    "Can I spend money on a new car?": "spendadvice", 
    "Can I spend money on sushi": "spendadvice", 
    "Can I spend one hundred dollars at the Italian restaurant?": "spendadvice", 
    "Can I spend one hundred dollars at the fair?": "spendadvice", 
    "Can I spend one hundred dollars on a new cell phone?": "spendadvice", 
    "Can I spend one thousand dollars in Hawaii?": "spendadvice", 
    "Can I spend ten dollars at the movies": "spendadvice", 
    "Can I spend ten dollars on food": "spendadvice", 
    "Can I spend three hundred dollars on a new suit?": "spendadvice", 
    "Can I spend twenty dollars at the grocery store?": "spendadvice", 
    "Can I spend twenty dollars on a taxi": "spendadvice", 
    "Can I splurge $20 on a new purse?": "spendadvice", 
    "Can I splurge on a $12500 fur headband?": "spendadvice", 
    "Can I walk to the nearest bank or ATM?": "location", 
    "Can i spend a few dollars on this purse?": "spendadvice", 
    "Can we afford a trip to Disney next year?": "spendadvice", 
    "Can you break down how much I spent in cash and on credit in Rio?": "history", 
    "Can you display my transactions from last week?": "txnlist", 
    "Can you find me an ATM?": "location", 
    "Can you find the nearest bank": "location", 
    "Can you give me a list of my transactions?": "txnlist", 
    "Can you give me an idea of how much I've spent in the last month in Danbury?": "history", 
    "Can you give me directions to the nearest bank or ATM?": "location", 
    "Can you list everything I've bought this month and sort it by type of expense?": "txnlist", 
    "Can you list out, by category, everything I spent money on this month?": "txnlist", 
    "Can you list your transactions for the past month broken down by cost and type?": "txnlist", 
    "Can you move $22 dollars from account 1 to account 2?": "transfer", 
    "Can you move $50 to saving?": "transfer", 
    "Can you please tell me how much money was deposited into my saving account from my job last week?": "income", 
    "Can you please transfer funds between two of my bank accounts?": "transfer", 
    "Can you provide a listing of transactions for Model X only sorted by cost?": "txnlist", 
    "Can you pull up a map showing me where the nearest bank or ATM is?": "location", 
    "Can you put $400 from my business account into my personal account.": "transfer", 
    "Can you read my off my last 10 transactions?": "txnlist", 
    "Can you send 50 bucks from my checking to my savings?": "transfer", 
    "Can you show me a calendar of my paydays since January 2015?": "payday", 
    "Can you show me a list of my recent transactions?": "txnlist", 
    "Can you show me a list of transactions?": "txnlist", 
    "Can you show me all purchases under $10.00?": "txnlist", 
    "Can you show me my account balance from Chase?": "balance", 
    "Can you show me my bank statement?": "txnlist", 
    "Can you show me my transactions for the last half of the month?": "txnlist", 
    "Can you show me the deposits I've received from amazon?": "txnlist", 
    "Can you show me the nearest bank or ATM?": "location", 
    "Can you show me the transactions where I spent more than 100 last month?": "txnlist", 
    "Can you tell me how much I spent at walmart yesterday?": "history", 
    "Can you tell me how much money I just spent on stuff at the dollar store?": "history", 
    "Can you tell me if I have 100 bucks for the grocery store?": "spendadvice", 
    "Can you tell me if there is a bank or ATM near the Raleigh fair grounds?": "location", 
    "Can you tell me my account balance?": "balance", 
    "Can you tell me the last ten places I have used my ATM Card at and the amount of money used?": "txnlist", 
    "Can you tell me the total amount received from amazon during the last one month?": "income", 
    "Can you tell me when is the next payday for me from amazon?": "payday", 
    "Can you track my income?": "income", 
    "Can you transfer $10 from my savings into my checking?": "transfer", 
    "Can you transfer $100 from my savings into my checking?": "transfer", 
    "Can you transfer $5 to my other account?": "transfer", 
    "Can you transfer eighty dollars from my saving account to my checking account?": "transfer", 
    "Can you transfer money from my accounts?": "transfer", 
    "Can you transfer money from my checking account to my savings account?": "transfer", 
    "Can you transfer money from my checking to savings account?": "transfer", 
    "Can you transfer money from one of my accounts to another?": "transfer", 
    "Can you transfer one hundred dollars from checking to savings?": "transfer", 
    "Can you transfer some cash into my checking?": "transfer", 
    "Can you transfer some funds to different accounts please?": "transfer", 
    "Can you withdraw $250 from my savings and place it into my checking account?": "transfer", 
    "Categorize my spending by type": "history", 
    "Chase bank atm near me": "location", 
    "Check account balance.": "balance", 
    "Closest bank": "location", 
    "Could I have the current balance of my bank account?": "balance", 
    "Could I see my transaction from this week?": "txnlist", 
    "Could I spend $300 on a laptop?": "spendadvice", 
    "DATE OF LAST TRANSACTION": "txnlist", 
    "Debit 20 dollars from savings and credit it to checking": "transfer", 
    "Detail all the time I bought groceries last month.": "txnlist", 
    "Did I Spend a lot of money in Chicago?": "history", 
    "Did I earn more than $3,000.00 in January and February of 2016?": "income", 
    "Did I get paid recently?": "payday", 
    "Did I go over my budget in Atlanta?": "history", 
    "Did I make at least 500 this month?": "income", 
    "Did I make enough this month to pay for the new car?": "income", 
    "Did I pay all my bills?": "history", 
    "Did I spend a lot in Chicago?": "history", 
    "Did I spend fifty dollars at Kroger's on April sixth?": "history", 
    "Did I spend more in New York or Los Angeles?": "history", 
    "Did I spend more money this month?": "history", 
    "Did I spend more than $100 at the bar last night?": "history", 
    "Did I spend over $5000 on my August 2015 trip to San Francisco?": "history", 
    "Did I spend too much money in Canada?": "history", 
    "Did I spent $50 at Outback Steak House?": "history", 
    "Did taking that cruise clean out my bank account?": "history", 
    "Display all debit to wargaming.net 2015.": "txnlist", 
    "Display debits": "txnlist", 
    "Display deposits": "txnlist", 
    "Display recent": "txnlist", 
    "Display recent spending.": "txnlist", 
    "Display spending history": "history", 
    "Do I have $10 to spend on gas?": "spendadvice", 
    "Do I have $40 in my bank account to spend on a movie night?": "spendadvice", 
    "Do I have $5.00 in my account to spend on a latte at Starbucks?": "spendadvice", 
    "Do I have $50 for dinner in my account?": "spendadvice", 
    "Do I have $60 for a new xbox game?": "spendadvice", 
    "Do I have 45 bucks to buy gas in my checking account?": "spendadvice", 
    "Do I have any extra money in savings to go out tonight?": "spendadvice", 
    "Do I have any funds in my bank account?": "balance", 
    "Do I have any money available on my debit card?": "balance", 
    "Do I have any money left after flying to Brazil?": "balance", 
    "Do I have any money left in my back account?": "balance", 
    "Do I have any money left in my checking?": "balance", 
    "Do I have at least $100 in my account right now?": "balance", 
    "Do I have enough cash on hand to purchase a new phone?": "spendadvice", 
    "Do I have enough funds to buy food": "spendadvice", 
    "Do I have enough funds to purchase a new Apple Watch?": "spendadvice", 
    "Do I have enough funds to spend $10 in gas?": "spendadvice", 
    "Do I have enough in my account to pay for this?": "balance", 
    "Do I have enough in my account to pay off my $300 car payment": "spendadvice", 
    "Do I have enough money for a coffee": "spendadvice", 
    "Do I have enough money for the bar tonight": "spendadvice", 
    "Do I have enough money in my Key Bank account to purchase a new Mercedes?": "spendadvice", 
    "Do I have enough money in my account for a new Apple Watch?": "spendadvice", 
    "Do I have enough money in my account to cover $300 for a new laptop?": "spendadvice", 
    "Do I have enough money in my account to make this purchase?": "spendadvice", 
    "Do I have enough money in my bank account?": "balance", 
    "Do I have enough money to buy $10 of gas?": "spendadvice", 
    "Do I have enough money to buy a Michael Kors bag?": "spendadvice", 
    "Do I have enough money to buy a bike next week?": "spendadvice", 
    "Do I have enough money to buy a horse?": "spendadvice", 
    "Do I have enough money to buy a new laptop at Best Buy?": "spendadvice", 
    "Do I have enough money to buy clothes?": "spendadvice", 
    "Do I have enough money to buy that cat bed that costs $50?": "spendadvice", 
    "Do I have enough money to buy these concert tickets?": "spendadvice", 
    "Do I have enough money to pay my bills?": "balance", 
    "Do I have enough money to spend $50 on dinner?": "spendadvice", 
    "Do I have enough money to spend one hundred dollars at Walmart?": "spendadvice", 
    "Do I have enough to budget for a new phone?": "spendadvice", 
    "Do I have enough to buy concert tickets to the Cure for $200": "spendadvice", 
    "Do I have enough to pay for this meal?": "spendadvice", 
    "Do I have enough to purchase a $500 gaming system?": "spendadvice", 
    "Do I have enough to spend $15?": "spendadvice", 
    "Do I have enough to spend $50 on groceries?": "spendadvice", 
    "Do I have money in my account?": "balance", 
    "Do I have more that $300.00 in my savings account?": "balance", 
    "Do i have the funds for this restaurant?": "spendadvice", 
    "Do we have enough money to pay for 1 year tuition at The Ohio State University?": "spendadvice",  
    "Do you know if where a bank or ATM are?": "location", 
    "Do you see a purchase from Dairy Queen in my checking?": "txnlist",  
    "Does my account have enough to cover a new Apple Watch?": "spendadvice", 
    "During the third quarter of 2015, what were my earnings from Bob White Construction?": "income", 
    "Earnings last week": "income", 
    "Filter transactions by amount.": "txnlist", 
    "Filter transactions by date.": "txnlist", 
    "Find ATM close to me.": "location", 
    "Find account balance.": "balance", 
    "Find an ATM close to me.": "location", 
    "Find closest ATM to present location.": "location", 
    "Find how much I spent at the casino yesterday.": "history", 
    "Find me an ATM.": "location", 
    "Find me the closest automatic teller machine?": "location", 
    "Find my earnings from 2013 and 2015": "income", 
    "Find the bank nearest to me": "location", 
    "Find the bank nearest to me.": "location", 
    "Find the closest ATM.": "location", 
    "Find the closest bank": "location", 
    "Find the closest bank.": "location", 
    "Find the nearest ATM": "location", 
    "Find the nearest ATM.": "location", 
    "Find the nearest bank": "location", 
    "Find the nearest bank.": "location", 
    "Find a money machine.": "location", 
    "For the month of May 2016 how much money did I spend at Food City?": "history", 
    "Generate balance for checking account": "balance", 
    "Get 100 bucks from savings and put in my checking.": "transfer", 
    "Get me a list of my last three money transfers from amazon.": "txnlist", 
    "Get me the address to Chase Bank near me.": "location", 
    "Get money from one account and put it in the other.": "transfer", 
    "Give me a list of all the times I used my debit card yesterday.": "txnlist", 
    "Give me a list of grocery transactions for this month.": "txnlist", 
    "Give me a list of transaction under $20.": "txnlist", 
    "Give me an alphabetized list of all the transactions made on today.": "txnlist", 
    "Give me my account total.": "balance", 
    "Give me the address of the nearest ATM.": "location", 
    "Give me the exact amount I spent at Taco Bell?": "history", 
    "Go to account balance.": "balance", 
    "Google, how much money is in my amazon account?": "balance", 
    "Google, when did I last pay my electric bill?": "txnlist", 
    "Google, when will I get paid next?": "payday",  
    "HOW MUCH IS IN MY BANK ACCOUNT?": "balance",  
    "HOW MUCH MONEY DID I EARN FROM AMAZON LAST WEEK?": "income", 
    "HOW MUCH MONEY DID I EARN LAST YEAR?": "income", 
    "HOW MUCH MONEY DID I EARN YESTERDAY ON AMAZON?": "income", 
    "HOW MUCH MONEY DID I GET FROM WORKING ON THE AMAZON MECHANICAL TURK?": "income", 
    "HOW MUCH MONEY DID I SPEND AT WALMART?": "history", 
    "HOW MUCH MONEY DID I SPEND IN BLOOMSBURG, PA?": "history", 
    "HOW MUCH MONEY DID I SPEND IN BUCKHORN, PA?": "history", 
    "HOW MUCH MONEY DID I SPEND IN LONDON?": "history", 
    "HOW MUCH MONEY DID I SPEND IN MEXICO?": "history",   
    "HOW MUCH MONEY DO I HAVE LEFT IN MY ACCOUNT TO SPEND?": "balance", 
    "HOW MUCH MONEY HAVE I GOTTEN PAID FROM AMAZON?": "income", 
    "HOW MUCH MONEY IS THERE LEFT IN MY ACCOUNT FOR A HAIR CUT?": "balance", 
    "Have I made more money this year than last year?": "income", 
    "Have I spent a lot at Target lately?": "history", 
    "Have I spent more than $100 at the grocery store this week?": "history", 
    "Have I spent more than $100 on restaurants this month": "history", 
    "Help me transfer money from one of my accounts to another": "transfer", 
    "Hey set me up for a transfer.": "transfer", 
    "How close am I to Wells Fargo?": "location", 
    "How close to an ATM am I?": "location", 
    "How did I spend all of my money this month?": "history", 
    "How do I get to the closes Atm or Bank?": "location", 
    "How do I get to the closest ATM?": "location", 
    "How does your yearly income look like?": "income", 
    "How expensive was the trip to Philadelphia?": "history", 
    "How far am I from the nearest ATM or Bank?": "location", 
    "How far am I from the nearest ATM?": "location", 
    "How far away is the closest bank or ATM?": "location", 
    "How far away is the nearest bank or ATM?": "location", 
    "How far do I need to travel to find the nearest ATM": "location", 
    "How far is the closest ATM?": "location", 
    "How far is the closest bank from my location?": "location", 
    "How far is the nearest ATM or bank?": "location", 
    "How has my earned income been alloted?": "income", 
    "How has my money been earned in the past month?": "income", 
    "How have I spent my money": "history", 
    "How long has it been since I last got paid?": "payday", 
    "How long is it until I get paid?": "payday", 
    "How long of a drive is the nearest ATM?": "location", 
    "How long of a walk is it to the nearest home bank?": "location", 
    "How long until I get paid again?": "payday", 
    "How long until my next payday?": "payday", 
    "How much did i spend when iwas in Longmont?": "history", 
    "How how much did i spend while i in the mall in the city of Ft Lauderdale yesterday?": "history", 
    "How long will it take to travel to the nearest bank or ATM?": "location", 
    "How long would it take me to drive to the nearest credit union?": "location", 
    "How many benjamins did I rake in last march?": "income", 
    "How many benjamins lay in my piggy?": "balance", 
    "How many charges for the month of June 2016 do I have for gas?": "txnlist", 
    "How many checks have I used this month?": "txnlist",
    "How many days since my last payday?": "payday", 
    "How many days until I get paid again?": "payday", 
    "How many days until my next payday?": "payday",  
    "How many dollars and cents are in my account?": "balance", 
    "How many dollars did I make last month": "income", 
    "How many dollars did I spend in Liverpool?": "history", 
    "How many dollars did you spend in Britain?": "history", 
    "How many dollars per hour did I make last year?": "income", 
    "How many more pay days this month?": "payday", 
    "How many pay days this year?": "payday", 
    "How many paychecks or direct deposits have I received in the last month?": "income", 
    "How many paydays until Christmas?": "payday", 
    "How many paydays will I have in this month?": "payday", 
    "How many purchases did I make over $100 at Taco Bell?": "txnlist", 
    "How many purchases did i make today": "txnlist", 
    "How many times am I scheduled to get paid in the month of November of this year?": "payday", 
    "How many times did I buy gas last month?": "txnlist", 
    "How many times did I buy gas this month?": "txnlist", 
    "How many times did I get groceries these past 30 days?": "txnlist", 
    "How many times did I shop at kroger this week?": "txnlist", 
    "How many times did I spend $20 this month?": "txnlist", 
    "How many times did I use my card yesterday?": "txnlist", 
    "How many times did I use my debit card and spend over $10?": "txnlist", 
    "How many transacations were deducted in the last 24 hours?": "txnlist", 
    "How many transactions are in pending status?": "txnlist", 
    "How many transactions did I have last week?": "txnlist", 
    "How many transactions have I made?": "txnlist", 
    "How many transactions have passed this month?": "txnlist", 
    "How many transactions were over twenty dollars this week?": "txnlist", 
    "How many transfers have I had this month": "txnlist", 
    "How much I got in my checking account?": "balance", 
    "How much I spend when I went to Canada?": "history", 
    "How much am I spending on food?": "history", 
    "How much am I spending per week at Starbucks?": "history", 
    "How much can I spend at McDonalds?": "spendadvice", 
    "How much can I spend at Starbucks this week?": "spendadvice", 
    "How much can I spend on clothes?": "spendadvice", 
    "How much can I spend on clothes shopping this weekend": "spendadvice", 
    "How much can I spend on groceries?": "spendadvice", 
    "How much can i spend today?": "spendadvice", 
    "How much cash did you spend in Britain?": "history", 
    "How much credit can I spend on this plane ticket?": "spendadvice", 
    "How much damage did I cause my bank account at Fluffers?": "history", 
    "How much data is left on my account for this month?": "balance", 
    "How much did Amazon deposit in my account yesterday?": "payday", 
    "How much did I charge at McDonalds?": "history", 
    "How much did I charge at the country fair?": "history", 
    "How much did I charge in Philadelphia?": "history", 
    "How much did I currency did I convert in Spain?": "history", 
    "How much did I deposit in April?": "income", 
    "How much did I deposit yesterday?": "income", 
    "How much did I earn for the quarter?": "income", 
    "How much did I earn from July 1 to September 1?": "income", 
    "How much did I earn from June 2014 to April 2016": "income", 
    "How much did I earn in 2015": "income", 
    "How much did I earn in May?": "income", 
    "How much did I earn in all of my accounts?": "income", 
    "How much did I earn last month?": "income", 
    "How much did I earn last payday?": "income", 
    "How much did I earn on my last paycheck?": "income", 
    "How much did I earn on this day?": "income", 
    "How much did I get paid in April?": "income", 
    "How much did I get paid last week from work?": "income", 
    "How much did I get paid last week on Amazon?": "income", 
    "How much did I get paid?": "income", 
    "How much did I get payed on my last payday?": "payday", 
    "How much did I just spend at Mcdonalds?": "history", 
    "How much did I lose in Las Vegas": "history", 
    "How much did I make before my most recent pay raise": "income", 
    "How much did I make between March and July?": "income", 
    "How much did I make for april, 2015?": "income", 
    "How much did I make from Amazon Mechanical Turk yesterday?": "income", 
    "How much did I make in 2015?": "income", 
    "How much did I make in February?": "income", 
    "How much did I make in the month of February?": "income", 
    "How much did I make in total last month?": "income", 
    "How much did I make last month?": "income", 
    "How much did I make last week?": "income", 
    "How much did I make last year?": "income", 
    "How much did I make on July 15?": "income", 
    "How much did I make so far this week?": "income", 
    "How much did I make this month?": "income", 
    "How much did I pay for dinner tonight": "history", 
    "How much did I put on my credit card in Cabo?": "history", 
    "How much did I spend at JC Penney last month?": "history", 
    "How much did I spend at Jewel": "history", 
    "How much did I spend at Lowe's yesterday?": "history", 
    "How much did I spend at Macy's on May twenty fifth?": "history", 
    "How much did I spend at McDonalds last month?": "history", 
    "How much did I spend at Orlando Mall yesterday?": "history", 
    "How much did I spend at Starbucks in Oakland last week?": "history", 
    "How much did I spend at Taco Bell this morning?": "history", 
    "How much did I spend at Wal Mart last month?": "history", 
    "How much did I spend at WalMart": "history", 
    "How much did I spend at Walmart last week?": "history", 
    "How much did I spend at Walmart today?": "history", 
    "How much did I spend at Arizona?": "history", 
    "How much did I spend at grocery stores last month": "history", 
    "How much did I spend at restaurants over the past three weeks?": "history", 
    "How much did I spend at the Red Sox game last week?": "history", 
    "How much did I spend at the bar last night?": "history", 
    "How much did I spend at the bowling alley?": "history", 
    "How much did I spend at the exposition last month?": "history", 
    "How much did I spend at the flower boutique two days ago?": "history", 
    "How much did I spend at the grocery store today?": "history", 
    "How much did I spend at the mall yesterday?": "history", 
    "How much did I spend during Riot Fest?": "history", 
    "How much did I spend from my checking account today?": "history", 
    "How much did I spend from my savings account today?": "history", 
    "How much did I spend in Baltimore?": "history", 
    "How much did I spend in Chicago": "history", 
    "How much did I spend in prague in july?": "history", 
    "How much did I spend in Dallas?": "history", 
    "How much did I spend in France?": "history", 
    "How much did I spend in Germany last summer?": "history", 
    "How much did I spend in Hickory?": "history", 
    "How much did I spend in Los Angeles": "history", 
    "How much did I spend in ypsilanti?": "history", 
    "How much did I spend in Mexico": "history", 
    "How much did I spend in Ocean City?": "history", 
    "How much did I spend in Philadelphia?": "history", 
    "How much did I spend in San Antonio?": "history", 
    "How much did I spend in San Francisco last week?": "history", 
    "How much did I spend in Spain?": "history", 
    "How much did I spend in St. Louis in the month of april?": "history", 
    "How much did I spend in Tokyo": "history", 
    "How much did I spend in Vegas last weekend": "history", 
    "How much did I spend in Vegas last night?": "history", 
    "How much did I spend in Vegas?": "history", 
    "How much did I spend in Washington, D.C. in october": "history", 
    "How much did I spend in Weaverville, CA?": "history", 
    "How much did I spend in seattle?": "history", 
    "How much did I spend in dollars in Europe?": "history", 
    "How much did I spend in publix in sunrise?": "history", 
    "How much did I spend in the store khols in sunrise Florida?": "history", 
    "How much did I spend in total yesterday?": "history", 
    "How much did I spend last month": "history", 
    "How much did I spend last night": "history", 
    "How much did I spend last week?": "history", 
    "How much did I spend on Amazon": "history", 
    "How much did I spend on breakfast": "history", 
    "How much did I spend on food last week.": "history", 
    "How much did I spend on gas last month?": "history", 
    "How much did I spend on gas?": "history", 
    "How much did I spend on my last trip to New York City?": "history", 
    "How much did I spend on my trip to DC yesterday?": "history", 
    "How much did I spend on my trip to Italy?": "history", 
    "How much did I spend on vacation in Florida?": "history", 
    "How much did I spend on vacation?": "history", 
    "How much did I spend online last month?": "history", 
    "How much did I spend this year?": "history", 
    "How much did I spend today?": "history", 
    "How much did I spend yesterday during my time in France?": "history", 
    "How much did I spent at tomukun?": "history", 
    "How much did I spent on Amazon this month?": "history", 
    "How much did Etsy last pay me?": "income", 
    "How much did i spend at the grocery story I just went to": "history", 
    "How much did it cost for perfume at Belk's last month?": "history", 
    "How much did my ski trip cost?": "history", 
    "How much did my trip to Paris set me back?": "history", 
    "How much did pay for bills this month": "history", 
    "How much did that trip cost me": "history", 
    "How much did the Holiday Inn charge my Credit card?": "history", 
    "How much did we spend in Orlando last week?": "history", 
    "How much dinero do you make a hour?": "income",
    "How much do I earn on a typical weekday?": "income", 
    "How much do I earn per hour?": "income", 
    "How much do I get paid?": "income", 
    "How much do I have available to spend on groceries?": "balance", 
    "How much do I have for food?": "balance", 
    "How much do I have in my account right now?": "balance", 
    "How much do I have in my account?": "balance", 
    "How much do I have in the bank?": "balance", 
    "How much do I have in this account?": "balance", 
    "How much do I make in a year?": "income", 
    "How much do I make per hour?": "income", 
    "How much do I normally spend on the weekend?": "history",  
    "How much do I spend each month on groceries on average?": "history", 
    "How much do I spend on groceries at Krogers each month, please list last six months.": "txnlist", 
    "How much do I spend on the gas bill on average?": "history",  
    "How much does is a Apple Watch and can I afford it?": "spendadvice", 
    "How much extra did I make last month?": "income", 
    "How much federal tax did I pay?": "history", 
    "How much has Amazon paid me?": "income", 
    "How much has been spent on restaurants this week": "history", 
    "How much has been transferred into my account since January?": "income", 
    "How much have I been spending recently?": "history", 
    "How much have I earned so far this year?": "income", 
    "How much have I ever spent in or around Philadelphia?": "history", 
    "How much have I made in the last 30 days?": "income", 
    "How much have I made so far this year?": "income", 
    "How much have I recently spent?": "history", 
    "How much have I spend eating out this month?": "history", 
    "How much have I spent at Walmart?": "history", 
    "How much have I spent in Danbury?": "history", 
    "How much have I spent in all retail stores during the last 12 months?": "history", 
    "How much have I spent in the past week?": "history", 
    "How much have I spent of checkings, this month?": "history", 
    "How much have I spent of savings, this month?": "history", 
    "How much have I spent on coffee this week?": "history", 
    "How much have I spent on entertainment this week?": "history", 
    "How much have I spent on food this month?": "history", 
    "How much have I spent on food this week?": "history", 
    "How much have I spent on groceries this month?": "history", 
    "How much have I spent this week?": "history", 
    "How much income did I bring in last year?": "income", 
    "How much income have I had since January?": "income", 
    "How much interest have I earned in my savings account this year?": "history", 
    "How much is available in my account?": "balance", 
    "How much is available in my checking account?": "balance", 
    "How much is available in my savings account?": "balance", 
    "How much is in both my savings and checking account?": "balance", 
    "How much is in my account?": "balance", 
    "How much is in my bank account?": "balance", 
    "How much is in my checking account": "balance", 
    "How much is in my checking account?": "balance", 
    "How much is in my savings account?": "balance", 
    "How much is left in my account?": "balance", 
    "How much is left on my account?": "balance", 
    "How much money came from direct deposit via my employer?": "income", 
    "How much money can I make in two days": "payday", 
    "How much money can I spend": "balance", 
    "How much money can I spend at the bar this weekend?": "spendadvice", 
    "How much money can I spend on clothes?": "spendadvice", 
    "How much money did Amazon put into my paypal account?": "income", 
    "How much money did I blow at the club last night?": "history", 
    "How much money did I burn in Las Vegas?": "history", 
    "How much money did I deposit into the account for this month?": "income", 
    "How much money did I earn between July 1 & September 1?": "income", 
    "How much money did I earn from my regular job last month": "income", 
    "How much money did I earn in 2015": "income", 
    "How much money did I earn in mturk?": "income", 
    "How much money did I earn in the last two weeks?": "income", 
    "How much money did I earn in the past 6 months?": "income", 
    "How much money did I earn last month from my job?": "income", 
    "How much money did I earn last month?": "income", 
    "How much money did I earn last week?": "income", 
    "How much money did I earn last weekend?": "income", 
    "How much money did I earn last year?": "income", 
    "How much money did I earn on my last pay check?": "income", 
    "How much money did I earn so far this year?": "income", 
    "How much money did I earn this year compared to five years ago?": "income", 
    "How much money did I earn yesterday?": "income", 
    "How much money did I make between January and June of last year?": "income", 
    "How much money did I make from July 1 to September 1?": "income", 
    "How much money did I make in 2015?": "income", 
    "How much money did I make in April 2016?": "income", 
    "How much money did I make last Summer?": "income", 
    "How much money did I make last month?": "income", 
    "How much money did I make last week?": "income", 
    "How much money did I make last year?": "income", 
    "How much money did I make on Amazon last month?": "payday", 
    "How much money did I make over the last four pay periods?": "income", 
    "How much money did I make this month": "income", 
    "How much money did I make this month?": "income", 
    "How much money did I make this week?": "income", 
    "How much money did I make today?": "income", 
    "How much money did I make yesterday": "income", 
    "How much money did I spend at Barnes and Noble?": "history", 
    "How much money did I spend at REI?": "history", 
    "How much money did I spend at dinner last week?": "history", 
    "How much money did I spend at guitar Center?": "history", 
    "How much money did I spend at restaurants last month?": "history", 
    "How much money did I spend driving across country?": "history", 
    "How much money did I spend golfing last week?": "history", 
    "How much money did I spend in Baltimore?": "history", 
    "How much money did I spend in Dayton, Tennessee for the 2015 year?": "history", 
    "How much money did I spend in Germany in October of 2014?": "history", 
    "How much money did I spend in Hickory?": "history", 
    "How much money did I spend in LA?": "history", 
    "How much money did I spend in Miami Fl. while on vacation?": "history", 
    "How much money did I spend in Nashville, Tennessee in May 2016?": "history", 
    "How much money did I spend in New York City, New York this year?": "history", 
    "How much money did I spend in San Antonio?": "history", 
    "How much money did I spend in San Diego?": "history", 
    "How much money did I spend in Washington, D.C.": "history", 
    "How much money did I spend in X?": "history", 
    "How much money did I spend on Dominos last year?": "history", 
    "How much money did I spend on dinning while I was in Atlanta Georgia over the weekend?": "history", 
    "How much money did I spend on movies and popcorn this evening?": "history", 
    "How much money did I spend this month?": "history", 
    "How much money did I spend this week?": "history", 
    "How much money did I spend today?": "history", 
    "How much money did I spend while I was in Mexico last month?": "history", 
    "How much money did I spent while I was in China?": "history", 
    "How much money did I use in New York": "history", 
    "How much money did I use in Washington, D.C.": "history", 
    "How much money did you spend in Britain?": "history", 
    "How much money do I currently have to spend freely?": "balance", 
    "How much money do I earn in a week": "income", 
    "How much money do I earn in a week?": "income", 
    "How much money do I have": "balance", 
    "How much money do I have in my account balance is euros?": "balance", 
    "How much money do I have in my account today?": "balance", 
    "How much money do I have in my account?": "balance", 
    "How much money do I have in my bank account?": "balance", 
    "How much money do I have in my checking account?": "balance", 
    "How much money do I have in my savings account?": "balance", 
    "How much money do I have in savings?": "balance", 
    "How much money do I have left in my account for grocery shopping?": "balance", 
    "How much money do I have left in my budget?": "balance", 
    "How much money do I have left today?": "balance", 
    "How much money do I have stored in Paypal?": "balance", 
    "How much money do I have to spend on dinner tonight?": "balance", 
    "How much money do I have to spend on vacation?": "balance", 
    "How much money do I have to spend?": "balance", 
    "How much money do I have?": "balance", 
    "How much money do I make an hour?": "income", 
    "How much money do I make daily": "income", 
    "How much money do I make each year?": "income", 
    "How much money do I make in 6 months?": "income", 
    "How much money do I make in a week?": "income", 
    "How much money do I make on a monthly basis?": "income", 
    "How much money do I make per hour": "income", 
    "How much money do i have left in my bank account": "balance", 
    "How much money do you spend each month in the United States?": "history", 
    "How much money have I earned for this year?": "income", 
    "How much money have I earned in ten years?": "income", 
    "How much money have I earned so far this year?": "income", 
    "How much money have I made for this year?": "income", 
    "How much money have I made in the past 5 years?": "income", 
    "How much money have I made this month?": "income", 
    "How much money have I made this year?": "income", 
    "How much money have I paid Verizion Wireless so far in 2016?": "history", 
    "How much money have I put in savings this past year?": "income", 
    "How much money have I spent at Walgreens in the year 2016 so far?": "history", 
    "How much money have I spent in Chicago?": "history", 
    "How much money have I spent on clothing?": "history", 
    "How much money have I spent on fast food lately?": "history", 
    "How much money have I spent on food?": "history", 
    "How much money have I spent on gas in the past month?": "history", 
    "How much money have I spent this week?": "txnlist", 
    "How much money have I spent today": "history", 
    "How much money have I spent?": "history", 
    "How much money have i spent in the last couple of days?": "history", 
    "How much money have i spent?": "history", 
    "How much money have you spent in the United States?": "history", 
    "How much money is currently in my bank account?": "history", 
    "How much money is in currently in my bank account?": "balance", 
    "How much money is in my account": "balance", 
    "How much money is in my account?": "balance", 
    "How much money is in my checking account?": "balance", 
    "How much money is in my savings account?": "balance", 
    "How much money is left in my back account after going to the mall?": "balance", 
    "How much money is left in my budget for food?": "spendadvice", 
    "How much money should I spend on clothes?": "spendadvice", 
    "How much money was added in 2015?": "income", 
    "How much money was deducted for federal taxes?": "history", 
    "How much money was deducted for state taxes?": "history", 
    "How much money was deposited on my April pay date?": "income", 
    "How much money was dinner in the city?": "history", 
    "How much money was spent on gas in June while in North Carolina?": "history", 
    "How much money was spent while I vacationed in Mexico earlier this year?": "history", 
    "How much money will I have left if I spend 100 dollars?": "balance", 
    "How much money will I have left in this account if I buy the iPad?": "balance", 
    "How much money will I make this year": "income", 
    "How much money will my paycheck be this period?": "income", 
    "How much money ya making?": "income", 
    "How much money's in my account?": "balance", 
    "How much moolah did I drop at Wendy's?": "history", 
    "How much more do I have in savings than in checking?": "balance", 
    "How much more do I make an hour this year compared to last?": "income", 
    "How much of my money have I spent?": "history", 
    "How much state tax did I pay?": "history",
    "How much money did I spend in Longmont?": "history", 
    "How much was I last payed?": "income", 
    "How much was deposited into checking from employer?": "income", 
    "How much was deposited into my account between July 1 and September 1?": "income", 
    "How much was deposited into my account last month?": "income", 
    "How much was deposited last week": "income", 
    "How much was my McDonald's for last week?": "history", 
    "How much was my interest last year": "income", 
    "How much was my last Amazon payment?": "income", 
    "How much was my last deposit?": "income", 
    "How much was my last direct deposit from work?": "income", 
    "When was my last paycheck": "payday", 
    "How much was my last paycheck?": "income", 
    "How much was my paycheck for last month?": "income", 
    "How much was my paycheck?": "income", 
    "How much was my work check from last week?": "income", 
    "How much was spent on hotel?": "history", 
    "How much was the TV I bought yesterday?": "history", 
    "How much was the cost of dinner at Denny's?": "history", 
    "How much was the last purchase on my credit card?": "history", 
    "How much was the last thing I bought?": "history", 
    "How much was the paycheck I received 1 week ago?": "income", 
    "How much was used in Mexico": "history", 
    "How much were groceries this week?": "history", 
    "How much were my direct deposits for last month?": "income", 
    "How much were my direct deposits for this year?": "income", 
    "How much were my expenses in Miami?": "history", 
    "How much will I get paid this week on Amazon?": "income", 
    "How much will I get paid?": "income", 
    "How much will I make next week?": "income", 
    "How much will my next paycheck from Amazon be?": "income", 
    "How much will my paycheck be for the next two weeks?": "income",  
    "How much is in my bank account currently?": "balance", 
    "How rich am I today?": "balance", 
    "How's my balance look?": "balance", 
    "How's my bank account?": "balance", 
    "I ask your assistance in funneling $0.25 from my business account to my house payment account": "transfer", 
    "I have a $300 laptop I want to purchase? Is there money to cover it in the account.": "spendadvice", 
    "I need $80 more in my checking account.": "transfer", 
    "I need a First National Bank near my home.": "location", 
    "I need a bank or ATM near Eiffel Tower?": "location", 
    "I need a list of all purchases under $20.": "txnlist", 
    "I need a list of all transactions less than $20.": "txnlist", 
    "I need a list of my transactions.": "txnlist", 
    "I need a list of what I spent at Starbucks last week.": "txnlist", 
    "I need an ATM close to the McDonalds on fifth avenue.": "location", 
    "I need an ATM.": "location", 
    "I need directions to the nearest bank.": "location", 
    "I need my account balance.": "balance", 
    "I need my current balance?  Thanks.": "balance", 
    "I need ten dollars transferred from my checking account to my savings account.": "transfer", 
    "I need to buy the new Air Jordans, do I have enough cash?": "spendadvice", 
    "I need to find a Bank of America close by.": "location", 
    "I need to find a nearby ATM can you tell me the closest to where I am?": "location", 
    "I need to find an ATM.": "location", 
    "I need to get to the nearest atm or bank.": "location", 
    "I need to know what my gross pay was for the last six months.": "income", 
    "I need to know what purchases I made on food.": "txnlist", 
    "I need to move money from one account to another.": "transfer", 
    "I need to see a list of all my transactions under $5.": "txnlist", 
    "I need to see a list of my recent transactions.": "txnlist", 
    "I need to see the last twenty transcations on my ATM card and how much they were for?": "txnlist", 
    "I need to transfer $400 into my checking from my savings.": "transfer", 
    "I need to transfer 100 dollars from savings to checking.": "transfer", 
    "I need to transfer money between my accounts": "transfer", 
    "I need to transfer money from my Amazon payments account to my debit bank card?": "transfer", 
    "I need to transfer money from my checking account to my savings account.": "transfer", 
    "I need to withdraw some money.": "location", 
    "I need you to add $50 from my checking into my savings account.": "transfer", 
    "I need you to put money in my other accout.": "transfer", 
    "I need you to transfer $2000 from my savings into my checking for tuition.": "transfer", 
    "I wanna spend $500 on the new iPhone, do I have enough": "spendadvice", 
    "I want to buy a $5000 Apple tablet and need to see the balance in my checking account.": "balance", 
    "I want to know my current balance.": "balance", 
    "I want to see how much I spent in Canada": "history", 
    "I want to transfer a thousand dollars from my IRA to my checking account.": "transfer", 
    "I want to transfer money between my accounts": "transfer", 
    "I was wondering how much did I spend in Miami?": "history", 
    "I went to Miami in June, how much did I spend?": "history", 
    "I would like my money transferred to the other account.": "transfer", 
    "I would like to find the bank that is nearest to us?": "location", 
    "I would like to see the list of my transactions.": "txnlist", 
    "I would like to set up a transfer between my accounts.": "transfer", 
    "I would like to transfer money between my accounts": "transfer", 
    "I'd like last 10 transactions, please.": "txnlist", 
    "I'd like to know how much I spent in Seattle": "history", 
    "I'd like to make a transfer please.": "transfer",
    "what are the purchases i made in london": "txnlist",
    "show me the transactions i made when i was in texas": "txnlist",
    "give me a list of the purchases i had when i was at marquette": "txnlist",
    "list the transactions i made when i was at boston": "txnlist",
    "I'd like to take $20 out of my personal account and transfer it to my son's account.": "transfer", 
    "If I have less than $100 in savings, move half my checking over to it.": "transfer", 
    "If I spend $50 at dinner, how much do I have left in my savings account?": "balance", 
    "If I spend $50 on dinner, how much money do I have left?": "balance", 
    "If I transfer $500 to savings, what is my new balance?": "balance", 
    "If I work all day tomorrow, I wonder if I can buy those new shoes I wanted?": "spendadvice", 
    "In New York, how much money did I spend?": "history", 
    "In my account do I have $300 for a laptop?": "spendadvice", 
    "In the last year, how much money have I made?": "income", 
    "In the past month where have I spent the most money?": "history", 
    "Income for last week": "income", 
    "Initiate transfer from checking to savings.": "transfer", 
    "Is $100 for this gift too much?": "spendadvice", 
    "Is an ATM nearby?": "location", 
    "Is it ok for me to pay $300 to fly to Chicago?": "spendadvice", 
    "Is it possible to break down the listing of transactions with the most expensive first?": "txnlist", 
    "Is it smart to buy this new guitar?": "spendadvice", 
    "Is my account balance lower than $100?": "balance", 
    "Is my balance in my account more than $100?": "balance", 
    "Is my bank close by?": "location", 
    "Is my current account balance in the black?": "balance", 
    "Is there 50 bucks on my card for gas?": "balance", 
    "Is there 45 bucks in my account for dinner?": "balance", 
    "Is there a PNC Bank nearby?": "location", 
    "Is there a bank or ATM around here?": "location", 
    "Is there a full service bank on my current route?": "location", 
    "Is there a nearby bank or ATM?": "location", 
    "Is there an ATM at the nearest bank?": "location", 
    "Is there an ATM closer to my current location than the one on Bridgeport?": "location", 
    "Is there an ATM near my favorite Starbucks?": "location", 
    "Is there an ATM nearby": "location", 
    "Is there an atm within 1 mile?": "location", 
    "Is there an atm within walking distance?": "location", 
    "Is there any banks near me": "location", 
    "Is there any money in my account?": "balance", 
    "Is there enough in my account for new shoes?": "spendadvice", 
    "Is there enough money in the checking account to pay the sitter?": "spendadvice", 
    "Is there enough to spend $100 on a birthday gift": "spendadvice", 
    "Is this book that costs $40 within my budget?": "spendadvice", 
    "It's transfer time!": "transfer", 
    "Itemize restaurant spending this month": "txnlist", 
    "Just how poor am I": "balance", 
    "Let me know how much money I've been spending": "history", 
    "Let me know how much money was spent in Dallas": "history", 
    "List all expenses over $30 from Lowes during the last quarter.": "txnlist", 
    "List all items purchased and cost from Starbucks on 9th Avenue.": "txnlist", 
    "List all my automobile transactions for 2015.": "txnlist", 
    "List all restaurant expenses for quarter three of 2015.": "txnlist", 
    "List all the banks that are near me": "location", 
    "List all the times I ate at this restaurant last month.": "txnlist", 
    "List all the times I shopped at kroger": "txnlist", 
    "List deposits from January to current": "txnlist", 
    "List last month's transactions my amount spent.": "txnlist", 
    "List my last five withdrawls": "txnlist", 
    "List my purchases for yesterday": "txnlist", 
    "List my transactions in Vegas": "txnlist", 
    "List my transactions in order starting with the most expensive.": "txnlist", 
    "Locate the ATM machine.": "location", 
    "Locate an ATM.": "location", 
    "Locate the closest ATM.": "location", 
    "Locate the closest bank.": "location", 
    "Locate the nearest ATM.": "location", 
    "Locate the nearest Wells Fargo.": "location", 
    "Locate the nearest bank.": "location", 
    "Located an ATM near the casino San pablo.": "location", 
    "Look up my last thirty transcations where I spend over ten dollars please?": "txnlist", 
    "Money is needed where is the closest bank?": "location", 
    "Move $20 from my Wells Fargo checking account to my M&T checking account.": "transfer", 
    "Move $50 from Wells Fargo to CU Account, savings.": "transfer", 
    "Move $50 from checking to savings.": "transfer", 
    "Move $50 from savings to checking": "transfer", 
    "Move $50 into my checking account please.": "transfer", 
    "Move $50 to my checking account from my savings account": "transfer", 
    "Move $500 from parent checking to student checking on the 1st day of each month.": "transfer", 
    "Move $550 from savings to checking, note expense - new dishwasher.": "transfer", 
    "Move 20 dollars from savings to checking": "transfer", 
    "Move 20 dollars to checking from savings": "transfer", 
    "Move 50 from savings into checking.": "transfer", 
    "Move funds from my main account to my savings": "transfer", 
    "Move money from checking account.": "transfer", 
    "Move money from my checking account to my savings account.": "transfer", 
    "Move money from this account to that account": "transfer", 
    "Move money to checking from venmo": "transfer", 
    "Move my money from venmo to my bank account.": "transfer", 
    "Move the money from savings to my student debit account.": "transfer", 
    "Move 400 from account paypal to saving": "transfer", 
    "Move 46.02 dollars from my Amazon payments account to my checking account": "transfer", 
    "Navigate to the closest ATM.": "location",
    "show me transactions on food and restaurants in list form": "txnlist",
    "show me my spending when i was in new orleans in list form": "txnlist", 
    "Navigate to the closest Elevations FCU.": "location", 
    "Nearest bank": "location", 
    "Next payday scheduled": "payday", 
    "Oh magic conch, should I buy this car?": "spendadvice", 
    "On July fourth how much money did I spend on fireworks at Wacky Waynes?": "history", 
    "On May 6 how much money did I spend and at which grocery stores?": "history", 
    "On average, how much do I make an hour?": "income", 
    "On my trip to Canada in April 2016 how much money did I spend?": "history", 
    "On my trip to Miami, how much did I spend?": "history", 
    "On what day will I recieve my Amazon payment?": "payday", 
    "Organize banking transaction by date": "txnlist", 
    "PLEASE MOVE MONEY FROM SAVINGS ACCOUNT 1 TO CHECKING ACCOUNT 2 IN THE AMOUNT OF $500.": "transfer", 
    "Place $50 from my checking into my prepaid visa account.": "transfer", 
    "Place 100 bones into my checking and take it out of my savings.": "transfer", 
    "Place two hundred dollars in my checking account from my money market cd.": "transfer", 
    "Please create a calendar for my next ten paydays.": "payday", 
    "Please create a new transfer between my savings and checking.": "transfer", 
    "Please create a report of transactions in my account.": "txnlist", 
    "Please deposit money into my second account from my first account.": "transfer", 
    "Please find me the nearest bank.": "location", 
    "Please find the nearest ATM.": "location", 
    "Please find the nearest bank branch with an ATM.": "location", 
    "Please find the nearest bank branch.": "location", 
    "Please give me a filtered cost for groceries I have bought in the month of May 2016?": "txnlist", 
    "Please give me a list of my ten debit transactions.": "txnlist", 
    "Please give me my account balance.": "balance", 
    "Please help me I need money where is one located near where I am?": "location", 
    "Please list all transactions.": "txnlist", 
    "Please list my last ten food purchases": "txnlist", 
    "Please located the closest ATM associated with my bank.": "location", 
    "Please move a hundred dollars from my savings account to my checking account.": "transfer", 
    "Please pay $300 on my Capital One Credit Card this Friday by making a payment out of my Community Checking Account.": "transfer", 
    "Please provide spending history.": "history", 
    "Please pull up a list of my transactions.": "txnlist", 
    "Please pull up directions to the nearest bank.": "location", 
    "Please send one hundred dollars from my savings to my checking": "transfer", 
    "Please show a sortable list of transactions.": "txnlist", 
    "Please show me a list of transactions over $150.": "txnlist", 
    "Please show me all transcations for over $100 each in the year 2016?": "txnlist", 
    "Please show me any charges over $20.": "txnlist", 
    "Please show me my recent transactions.": "txnlist", 
    "Please show me over the last 90 days how much money I have spent on groceries?": "history", 
    "Please show my a list of my transaction from my bank": "txnlist", 
    "Please show my all of my transactions that are bill related": "txnlist", 
    "Please show my next payday.": "payday", 
    "Please show my transactions.": "txnlist", 
    "Please show transactions that happened in Danbury.": "txnlist", 
    "Please sort transactions by date.": "txnlist", 
    "how much have i spent on food when i was in toronto": "history",
    "how much did i spend at bars when i was in chicago": "history",
    "Please switch $250 from the savings to my checking": "transfer", 
    "Please take 100 dollars from my savings and put into my checking account.": "transfer", 
    "Please tell me how much I spent last night in Philly.": "history", 
    "Please tell me the amount of money I spent in Las Vegas": "history", 
    "Please transfer $100 to checking.": "transfer", 
    "Please transfer $20 from my checking to my savings account.": "transfer", 
    "Please transfer $200 from my savings to my checking account.": "transfer", 
    "Please transfer 10 dollars from my savings into checking.": "transfer", 
    "Please transfer enough money from my savings to my checking to pay for that TV.": "transfer", 
    "Please transfer money from checking to savings": "transfer", 
    "Please transfer money from my checking account to my savings account.": "transfer", 
    "Please transfer money in the amount of ten dollars from checking to savings.": "transfer", 
    "Please transfer money into my savings account.": "transfer", 
    "Please transfer money to mom.": "transfer", 
    "Plese transfer $200 every pay period from my checking account to my paypal account.": "transfer", 
    "Provide me with a list of every time I spent over $15 at the store.": "txnlist", 
    "Pull up my recent transactions please.": "txnlist", 
    "Put $20 from my checking into my savings.": "transfer", 
    "Put $20 in my checking": "transfer", 
    "Put $200 into my Amazon payments account on the third of every month from my savings account.": "transfer", 
    "Put $500 from checking into husband's account": "transfer", 
    "Put 100 bucks in my checking account from savings.": "transfer", 
    "Put money in chase savings from chase checking": "transfer", 
    "Put money in the other account from this one.": "transfer", 
    "Save me some dough and send $14 from my checking to the piggy bank fund": "transfer", 
    "Savings Balance today.": "balance", 
    "Schedule a transfer from checking to savings.": "transfer", 
    "Send $150 from my PayPal account to my savings": "transfer", 
    "Send $21 from Bank of America to my 401k": "transfer", 
    "Send money between PNC and Chase": "transfer", 
    "Send money from my savings to retirement fund": "transfer", 
    "Send money from my checking account to my savings account.": "transfer", 
    "Send money to different accunts please?": "transfer", 
    "Send money to savings account.": "transfer", 
    "Set a transfer of $30 to my savings account for tomorrow.": "transfer", 
    "Shoe me all transactions from Kmart.com for the last two months": "txnlist", 
    "Show expenditures.": "txnlist", 
    "Show a record of money spent.": "txnlist", 
    "Show a total spent at gas stations.": "history", 
    "Show all debits posted in Los Angeles": "txnlist", 
    "Show all grocery store transactions during the first six months of 2016.": "txnlist", 
    "Show all items purchased in the last 30 days from Target.": "txnlist", 
    "Show all payments from Amazon.com in June.": "income", 
    "Show any transaction to or from AT&T": "txnlist",
    "when did i get paid last?": "payday",
    "when do i get paid next at?": "payday",
    "Show cash withdrawals from ATMs only.": "txnlist", 
    "Show deposits.": "txnlist", 
    "Show earnings for November": "income", 
    "Show how much I've spent in Danbury since May.": "history", 
    "Show me purchases made on eastbay": "txnlist", 
    "Show me ATM's near me.": "location", 
    "Show me a list of all automatic bill pays.": "txnlist", 
    "Show me a list of my grocery purchases": "txnlist", 
    "Show me a list of my purchases yesterday.": "txnlist", 
    "Show me a list of my recent credit card transactions.": "txnlist", 
    "Show me a list of my spending.": "txnlist", 
    "Show me a list of transaction in the past few days": "txnlist", 
    "Show me a list of transactions made in restaurants.": "txnlist", 
    "Show me a list of transactions under one hundred dollars": "txnlist", 
    "Show me a nearby ATM.": "location", 
    "Show me all cash deposits from Amazon Mturk.": "txnlist", 
    "Show me all check transactions for amounts over one hundred dollars.": "txnlist", 
    "Show me all counter deposits for amounts over fifteen dollars.": "txnlist", 
    "Show me all counter withdrawals over the amount of twenty dollars.": "txnlist", 
    "Show me all credit card transactions made in the last week": "txnlist", 
    "Show me all income last month": "income", 
    "Show me all my recent transactions.": "txnlist", 
    "Show me all my transactions this week.": "txnlist", 
    "Show me all of my Debit card transactions in chronological order for yesterday.": "txnlist", 
    "Show me all of my purchases under $20.": "txnlist", 
    "Show me all of my transactions.": "txnlist", 
    "Show me all the credits to my account.": "txnlist", 
    "Show me all the debits to my account.": "txnlist", 
    "Show me all the times I shopped at urban outfitters in the past 30 days": "txnlist", 
    "Show me all the transactions for last month.": "txnlist", 
    "Show me all the transactions from online shopping.": "txnlist", 
    "Show me all transactions for the past month for REI including various filters, such as cost, type, etc.": "txnlist", 
    "Show me all transactions from last week?": "txnlist", 
    "Show me all transactions made yesterday": "txnlist", 
    "Show me all transactions under $20.": "txnlist", 
    "Show me any deposits I made in the last year": "txnlist", 
    "Show me any transfers from my Amazon payment account": "txnlist", 
    "Show me how I've spent my funds": "history", 
    "Show me how many times I shopped at Gucci last year": "txnlist", 
    "Show me how many times I spent exactly $6.66": "txnlist", 
    "Show me how much I spent on food.": "history", 
    "Show me how much money I spent.": "history", 
    "Show me how much money i have": "balance", 
    "Show me how much money is in my bank account.": "balance", 
    "Show me how to get to a nearby bank.": "location", 
    "Show me my account balance.": "balance", 
    "Show me my bank account balance today.": "balance", 
    "Show me my coffee purchases from this week.": "txnlist", 
    "Show me my debit card purchases.": "txnlist", 
    "Show me my last five paydays.": "payday", 
    "Show me my latest Amazon purchases.": "txnlist", 
    "Show me my past transactions for this month.": "txnlist", 
    "Show me my spending history": "history", 
    "Show me my transactions by cost.": "txnlist", 
    "Show me my transactions by type.": "txnlist", 
    "Show me my transactions for this last week.": "txnlist", 
    "Show me my transactions this past hour.": "txnlist", 
    "Show me my transactions.": "txnlist", 
    "Show me recent transactions on restaurants": "txnlist", 
    "Show me spending history.": "history", 
    "Show me the balance in my checking account subtracting $1500 for a trip to Las Vegas that I want to make.": "balance", 
    "Show me the balance in my savings account at Key Bank.": "balance", 
    "Show me the current balance of my Macy's account.": "balance", 
    "Show me the data from my most recent payday": "payday", 
    "Show me the last transaction on my Nordstrom's account and the current balance.": "balance", 
    "Show me the list of all my transactions?": "txnlist", 
    "Show me the most expensive costs in my life the past few months?": "txnlist", 
    "Show me the nearest ATM in my area.": "location", 
    "Show me the nearest ATM.": "location", 
    "Show me the nearest Key Bank.": "location", 
    "Show me the nearest gas station with an ATM.": "location", 
    "Show me transactions for 10.00 and up.": "txnlist", 
    "Show me what payments were made this month.": "txnlist", 
    "show me how i've been spending money this month": "history",
    "Show me when I've withdrawn money from my checking account.": "txnlist", 
    "Show me where I have spent my money today.": "history", 
    "show me how I have spent my money today.": "history",
    "Show me where I spend my money.": "history", 
    "Show me where I spent the most money for this last week.": "history", 
    "Show my all of my transactions at walmart in the last month.": "txnlist", 
    "Show my all transactions made in the month of July": "txnlist", 
    "Show my bank balance.": "balance", 
    "Show my current bank information.": "balance", 
    "Show only purchaces at gas stations.": "txnlist", 
    "Show paydays that are one week before a holiday": "payday", 
    "Show total debit purchases for May.": "txnlist", 
    "Show transactions for my credit card.": "txnlist", 
    "Show transactions.": "txnlist", 
    "Since arriving in the United States, how much money did you spend?": "history", 
    "Sort my spending history by amount": "txnlist", 
    "Spending history please.": "history", 
    "Starting with the most expensive, please show me the list of my transactions for this month.": "txnlist", 
    "TRANSFER $50 FROM SAVINGS TO CHECKING": "transfer", 
    "Take $50 from money market account to checking": "transfer", 
    "Take $50 out of checking and put it in savings.": "transfer", 
    "Take 500 bucks from savings and deposit it in my checking account.": "transfer", 
    "Take me to my bank.": "location", 
    "Take money from this account and move it to the other.": "transfer", 
    "Take money from savings to CD": "transfer", 
    "Take out money from venmo and put it into checking": "transfer", 
    "Tell me about the cost of my trips to costco": "txnlist", 
    "Tell me earnings last 6 weeks": "income", 
    "Tell me everything I bought that was under $5.00 from January 2015 to January 2016 or What did I buy for $5.00 in January of 2016?": "txnlist", 
    "Tell me how much I made last month": "income", 
    "Tell me how much money and where I spent yesterday.": "history", 
    "Tell me if I have enough to buy a $10 bottle of wine.": "spendadvice", 
    "Tell me my next payday.": "payday", 
    "Tell me my next three pay days listed": "payday", 
    "Tell me the balance in my account.": "balance", 
    "Tell me the balance in my checking account.": "balance", 
    "Tell me the balance in my savings account.": "balance", 
    "Tell me the total left in my bank account": "balance", 
    "Tell me where I spent money today.": "history", 
    "Tell me where the closest free atm is located.": "location", 
    "Tell me where the nearest branch of my bank is?": "location", 
    "This money needs to go into my other account.": "transfer", 
    "This watch is on sale, only $200, what do you think?": "spendadvice", 
    "Time to transfer!": "transfer", 
    "Total all expenses for the July 2013, August 2014, and May 2015 trips to New York City.": "history", 
    "Total all expenses from the July 2013 trip to Mexico.": "history", 
    "Total expenditures while in New York.": "history", 
    "Total of all Las Vegas transactions.": "history", 
    "Total transactions at quick trips in July.": "history", 
    "Transactions, now.": "txnlist", 
    "Transfer $900.00 from my savings account to my checking account.": "transfer", 
    "Transfer $10.00 to my savings account": "transfer", 
    "Transfer $100 from Account A into Account B.": "transfer", 
    "Transfer $555 from my savings account to my checking account.": "transfer", 
    "Transfer $1000 from savings to checking, Wells Fargo account.": "transfer", 
    "Transfer $700 from savings to checking.": "transfer", 
    "Transfer $100 into my savings account from my checking.": "transfer", 
    "Transfer $69 to checking from savings.": "transfer", 
    "Transfer $3 to my checking account from my savings account.": "transfer", 
    "Transfer one hundred dollars to my savings account from my checking account": "transfer", 
    "Transfer fifty bucks from personal checking to hubby's checking": "transfer", 
    "Transfer 400 dollars out of my Community Debit Card to my Amazons payments account this Monday August 1, 2016.": "transfer", 
    "Transfer 80 dollars from personal checking to personal savings": "transfer", 
    "Transfer $12 from account 1 to account 2.": "transfer", 
    "Transfer $43 from checking to savings": "transfer", 
    "Transfer $150 cash advance from my Visa to my checking account": "transfer", 
    "Transfer $20.00 from my checking account to my savings accounts.": "transfer", 
    "Transfer $20.00 from personal savings to business checking": "transfer", 
    "Transfer $200.00 from my savings to my car loan.": "transfer", 
    "Transfer $25.00 from business checking to business savings": "transfer", 
    "Transfer $250 from checking to savings on the 15th of each month.": "transfer", 
    "Transfer $50 every third Friday from Account A into Account B.": "transfer", 
    "Transfer $50 from Elevations to Air Academy.": "transfer", 
    "Transfer $50 from checking to savings at Elevations.": "transfer", 
    "Transfer $50.00 from personal checking to little bit's savings": "transfer", 
    "Transfer 707 from savings into my certificate of deposit.": "transfer", 
    "Transfer 10 percent of my checking account into my savings.": "transfer", 
    "Transfer 230 bucks from my checking account into my savings account.": "transfer", 
    "Transfer 20 dollars from savings to checking": "transfer", 
    "Transfer 29 dollars to checking from my savings account": "transfer", 
    "Transfer 61 bucks from my checkings to savings please?": "transfer", 
    "Transfer a couple hundred dollars from my savings into my checking.": "transfer", 
    "Transfer all the funds in Account B into Account A.": "transfer", 
    "Transfer enough money for pizza into my account.": "transfer", 
    "Transfer enough money so I have an equal amount in checking and savings.": "transfer", 
    "Transfer everything from checking to savings, but leave $100 in checking.": "transfer", 
    "Transfer everything from my Amazon payments account into my checking account": "transfer", 
    "Transfer everything in my saving account to my checking account": "transfer", 
    "Transfer fifty dollars from my checking account to my savings account.": "transfer", 
    "Transfer five hundred dollars from my money market account to my savings account.": "transfer", 
    "Transfer funds please.": "transfer", 
    "Transfer money from Account A to Account B": "transfer", 
    "Transfer money from checking to money market.": "transfer", 
    "Transfer money from checking to saving.": "transfer", 
    "Transfer money from checking to savings.": "transfer", 
    "Transfer money from money market to checking.": "transfer", 
    "Transfer money from my checking account to my savings account.": "transfer", 
    "Transfer money from my checking account.": "transfer", 
    "Transfer money from my checking to my home loan.": "transfer", 
    "Transfer money from my checking to my savings account.": "transfer", 
    "Transfer money from my checking to my savings.": "transfer", 
    "Transfer money from my savings account.": "transfer", 
    "Transfer money from my savings to my checking.": "transfer", 
    "Transfer money from one account to another.": "transfer", 
    "Transfer money from saving to checking.": "transfer", 
    "Transfer money from savings to money market.": "transfer", 
    "Transfer money from this account into another account.": "transfer", 
    "Transfer money from this account to the other account.": "transfer", 
    "Transfer money from chase account to wells fargo savings": "transfer", 
    "Transfer money into personal from shared account": "transfer", 
    "Transfer money to account": "transfer", 
    "Transfer money within my accounts.": "transfer", 
    "Transfer my rent and utilities amounts from spending into saving.": "transfer", 
    "Transfer one hundred dollars from my checking to my savings": "transfer", 
    "Transfer ten dollars from checking to savings.": "transfer", 
    "Transfer fourteen dollars to my checking account from my savings": "transfer", 
    "Transfer the balance of my savings into my checking.": "transfer", 
    "Transfer twenty four dollars from my checking to my savings": "transfer", 
    "Transfer twenty dollars from my savings to my checking": "transfer", 
    "Transfer 101.23 from my checking account to my savings account": "transfer", 
    "Transfer 1.99 to my savings account from my checking account": "transfer", 
    "Update me on my account status": "balance", 
    "WHAT IS MY ACCOUNT BALANCE NOW?": "balance", 
    "WHAT WAS MY ACCOUNT BALANCE YESTERDAY?": "balance", 
    "Watcha future payments look like?": "payday", 
    "What ATM is closest to me?": "location", 
    "What amount did I receive from Panera Bread, Inc. during the 2015 fiscal year?": "income", 
    "What amount did I spend in San Antonio?": "history", 
    "What amount of money did you spend in Britain?": "history", 
    "What are all my lastest transactions?": "txnlist", 
    "What are may pay dates going to be in August and September": "payday", 
    "What are my account details?": "balance", 
    "What are my card's transactions from this month?": "txnlist", 
    "What are my current balances?": "balance", 
    "What are my earnings for year 2016": "income", 
    "What are my grocery transactions for last month?": "txnlist", 
    "What are my largest transactions this month?": "txnlist", 
    "What are my most recent transactions?": "txnlist", 
    "What are my pending transactions?": "txnlist", 
    "What are my recent transactions?": "txnlist", 
    "What are the funds in my account": "balance", 
    "What are your payments looking like?": "payday", 
    "What are your spending habits like in the United States?": "history", 
    "What bank is closest to me?": "location", 
    "What bank is easiest for me to get to?": "location", 
    "What bank is the closest to me?": "location", 
    "What bills were paid in May of 2016? or Did I pay the electric bill in May?": "txnlist", 
    "What category do I spend the most money in?": "history", 
    "What category do I spend the most on?": "history", 
    "What date is my next pay day?": "payday", 
    "What day did I get paid in April?": "payday", 
    "What day do I receive payment from Amazon?": "payday", 
    "What day do I usually get payed on?": "payday", 
    "What day is my next payday?": "payday", 
    "What day is payday this month?": "payday", 
    "What day was I paid?": "payday", 
    "What day will I be getting paid?": "payday", 
    "What day will I be paid next?": "payday", 
    "What days were my paydays on?": "payday", 
    "What did I end up spending in El Paso last March?": "history", 
    "What did I make in February 2016": "income", 
    "What did I make on Amazon today?": "income", 
    "What did I recently spend the most money on?": "history", 
    "What did I spend at Target during the month of March?": "history", 
    "What did I spend in Austin?": "history", 
    "What did I spend in Paris?": "history", 
    "What did I spend in Philadelphia?": "history", 
    "What did I spend my money on yesterday?": "history", 
    "What did I spend on light bulbs last month?": "history", 
    "What did I spend on lunch while I was on my business trip in Texas?": "history", 
    "What did I tip the dancers at the club black last night?": "history", 
    "What did it cost me to fly to the Bahamas in April?": "history", 
    "What do I have in the bank?": "balance", 
    "What do I spend most of my money on?": "history", 
    "What do my paychecks look like?": "income", 
    "What does my money look like": "balance", 
    "What does my post-Vegas balance look like?": "balance", 
    "What does the computer say about my account balance?": "balance", 
    "What have I been buying lately?": "txnlist", 
    "What have I been spending my money on?": "history", 
    "What have I spent money on": "history", 
    "What have I spent my money on this week?": "history", 
    "What is my account balance": "balance", 
    "What is my account balance Siri?": "balance", 
    "What is my account balance according to the ATM?": "balance", 
    "What is my account balance after visiting San Diego?": "balance", 
    "What is my account balance as of today?": "balance", 
    "What is my account balance on my computer?": "balance", 
    "What is my account balance?": "balance", 
    "What is my average income?": "income", 
    "What is my average paycheck worth?": "income", 
    "What is my balance": "balance", 
    "What is my balance at Elevations?": "balance", 
    "What is my balance?": "balance", 
    "What is my bank balance?": "balance", 
    "What is my checking account balance ?": "balance", 
    "What is my checking account balance?": "balance", 
    "What is my checking available balance?": "balance", 
    "What is my current account balance?": "balance", 
    "What is my current balance?": "balance", 
    "What is my current bank balance?": "balance", 
    "What is my current cash flow situation?": "income", 
    "What is my current checking balance?": "balance", 
    "What is my financial situation?": "balance", 
    "What is my gross pay for the previous month?": "income", 
    "What is my highest paycheck?": "income", 
    "What is my last deposit amount": "income", 
    "What is my net pay for the previous month?": "income", 
    "What is my projected total earnings for this year?": "income", 
    "What is my restaurant spending habit like this month?": "history", 
    "What is my spending history?": "history", 
    "What is my total account saving?": "balance", 
    "What is my total spent in San Antonio?": "history", 
    "What is my yearly income?": "income", 
    "What is the actual balance of my checking account?": "balance", 
    "What is the amount of my last amazon transaction?": "txnlist", 
    "What is the available balance of my checking account?": "balance", 
    "What is the balance due on my bank issued credit card?": "balance", 
    "What is the balance in my Amazon payments account?": "balance", 
    "What is the balance in my PayPal account?": "balance", 
    "What is the balance in my account?": "balance", 
    "What is the balance in my checking account?": "balance", 
    "What is the balance in my money market?": "balance", 
    "What is the balance in my savings account?": "balance", 
    "What is the balance of my bank account?": "balance", 
    "What is the balance of my checking account?": "balance", 
    "What is the balance on my account?": "balance", 
    "What is the balance on my line of credit?": "balance", 
    "What is the closest ATM from my current location?": "location", 
    "What is the closest ATM or bank to here?": "location", 
    "What is the closest ATM or bank to me?": "location", 
    "What is the closest ATM to me right now?": "location", 
    "What is the closest ATM to my location?": "location", 
    "What is the date of my next payday?": "payday", 
    "What is the difference in my checking balance since yesterday?": "balance", 
    "What is the item I spend the most money on?": "history", 
    "What is the last transaction": "txnlist", 
    "What is the most expensive thing I bought this past month?": "txnlist", 
    "What is the name of the nearest ATM or bank?": "location", 
    "What is the nearest bank to my house?": "location", 
    "What is the nearest bank?": "location", 
    "What is the projected amount I am going to receive on my next payday?": "income", 
    "What is the total I made in July": "income", 
    "What is the total amount I have been paid by ebay?": "income", 
    "What is the total amount I have earned in all my past paydays?": "income", 
    "What is the total amount I have in my checking account?": "balance", 
    "What is the total amount I spend in San Antonio?": "history", 
    "What is the total amount of money in US Dollars that I spent in Germany?": "history", 
    "What is the total balance of all my accounts?": "balance", 
    "What is the walking distance to my nearest Wells Fargo?": "location", 
    "What kind of money am I making?": "income", 
    "how much do i make": "income",
    "What money do I have": "balance", 
    "What money do I have left": "balance", 
    "What purchases have I made that are over $50?": "txnlist", 
    "What sort of activities or products did I spend money on this month?": "history", 
    "i spent how much in Longmont?": "history", 
    "how much i spend in cleveland?": "history", 
    "What types of things have I spent my money on this month?": "history", 
    "What value of dollars did you spend in Britain?": "history", 
    "What was charged to my card for my stay at the San Francisco Sheraton?": "txnlist", 
    "What was my April pay date?": "payday", 
    "What was my account balance after Vegas?": "balance", 
    "What was my biggest purchase at Ikea last month?": "txnlist", 
    "What was my checking balance on May first 2016": "balance", 
    "What was my husband's total income last year?": "income", 
    "What was my income last year?": "income", 
    "What was my largest purchase?": "txnlist", 
    "What was my last paycheck amount from Bob White Construction?": "income", 
    "What was my last purchase?": "txnlist", 
    "What was my mortgage payment last month?": "txnlist", 
    "What was my most recent transaction?": "txnlist", 
    "What was my regular pay before overtime for last week?": "income", 
    "What was my reported income for last year?": "income", 
    "What was my spending in Austin?": "history", 
    "What was my spending like in San Francisco?": "history", 
    "What was my total income in 2015?": "income", 
    "What was my total income last month?": "income", 
    "What was my total income last year?": "income", 
    "What was my total spending in Washington, D.C.": "history", 
    "What was my total spent in France?": "history", 
    "What was our total household income in 2014?": "income", 
    "What was spent on the picnic yesterday at the park?": "history", 
    "What was the amount of my last paycheck?": "income", 
    "What was the amount of my last salary direct deposit?": "income", 
    "What was the amount of my last three paychecks?": "income", 
    "What was the average deposit in checking for the last six months?": "income", 
    "What was the date of pay last received?": "payday", 
    "What was the last thing I bought?": "txnlist", 
    "What was the total I spent in Washington, D.C.": "history", 
    "What was the total amount I spent at the park last week?": "history", 
    "What was the total amount I spent in Hickory?": "history", 
    "What was the total amount I spent in Orangeburg?": "history", 
    "What was the total amount spent during this past month?": "history", 
    "What was the total cost of my trip to Chicago?": "history", 
    "What was the total expense while in Minneapolis last month?": "history", 
    "What week of the month do I spend the most?": "history", 
    "What were last month's transactions by date?": "txnlist", 
    "What were my earnings last year?": "income", 
    "What were my last 3 transactions?": "txnlist", 
    "What were my last 5 purchases": "txnlist", 
    "What were my last two deposits": "txnlist", 
    "What were my total earnings for all of June": "income", 
    "What were my transactions for the month of March 2016?": "txnlist", 
    "What were the total costs in Philadelphia?": "history", 
    "What will I make before taxes this month?": "income", 
    "What will be my balance on my account after my paycheck clears?": "balance", 
    "What would I get if I wanted a listing of transactions sorted first by type and then by cost?": "txnlist", 
    "What would my account balance look like at this moment?": "balance", 
    "What's left in my checking account?": "balance", 
    "What's my account balance?": "balance", 
    "What's my account's situation?": "balance", 
    "What's my balance after I spend twenty at the gas station?": "balance", 
    "What's my balance for both accounts?": "balance", 
    "What's my bank account total?": "balance", 
    "What's my current account balance?": "balance", 
    "What's my current balance after my last purchase": "balance", 
    "What's my past spending been looking like?": "history", 
    "What's my salary?": "income", 
    "What's my spending on eBay look like?": "txnlist", 
    "What's my spending power today?": "balance", 
    "What's my total available balance in my checking account?": "balance", 
    "What's my total income from last week?": "income", 
    "What's the amount of money in my account right now?": "balance", 
    "What's the biggest paycheck I have received from Amazon?": "income", 
    "What's the distance to the nearest ATM?": "location", 
    "What's the state of my financial affairs?": "balance", 
    "What's the total amount I spent at the store I went to": "history", 
    "What's the total amount of money in my account?": "balance", 
    "What's total amount I received from Panera Bread, Inc over the past two years?": "income", 
    "When I was in Hickory how much did I spend?": "history", 
    "When am I getting paid next?": "payday", 
    "When and where have I spent the most money?": "history", 
    "When are you going to pay in the future?": "payday", 
    "When date is my closest payday to Christmas 2016?": "payday", 
    "When did I buy 50 dollars worth of stuff at dunhams?": "history", 
    "When did I get my last direct deposit": "payday", 
    "When did I get paid last": "payday", 
    "When did I get paid last?": "payday", 
    "When did I last get paid?": "payday", 
    "When did I receive my last five payments from Amazon": "payday", 
    "When did I recieve my last payment from my Mturk account?": "payday", 
    "When did my Amazon payment get deposited into the checking account?": "payday", 
    "When did my last Amazon payment go through?": "payday", 
    "When do I get paid next?": "payday", 
    "When do I get paid three times in one month": "payday", 
    "When is my next university payday?": "payday", 
    "When is my next paycheck?": "payday", 
    "When is my next payday scheduled for": "payday", 
    "When is my next payday via direct deposit by employer?": "payday", 
    "When is my next payday?": "payday", 
    "When is my next payment scheduled?": "payday", 
    "When is payday?": "payday", 
    "When is the next pay day?": "payday", 
    "When is the next payday for me from other than from the school?": "payday", 
    "When was I paid last?": "payday", 
    "When was my April pay day?": "payday", 
    "When was my last deposit from my employer?": "payday", 
    "When was my last deposit?": "payday", 
    "When was my last payday?": "payday", 
    "When was my last payment from Ford?": "payday", 
    "When was the last company deposit in my account?": "payday", 
    "When was the last time I got paid?": "payday", 
    "When was the last time I was paid?": "payday", 
    "When will I be out of the red again?": "payday", 
    "When will I get my next check?": "payday", 
    "When will I get paid again?": "payday", 
    "When will I get paid next?": "payday", 
    "When will I next get paid?": "payday", 
    "When will I receive my next check?": "payday", 
    "When's my next payday?": "payday", 
    "When's payday?": "payday", 
    "When's the next time I'm getting paid?": "payday", 
    "Where and how much have I spent since Tuesday?": "history", 
    "Where am I spending most of my money, this year?": "history", 
    "Where are all the local ATMs": "location", 
    "Where are the closest bank or ATM to my current location?": "location", 
    "Where are the closest banks?": "location", 
    "Where can I deposit my cheque?": "location", 
    "Where can I find a bank within 2 miles?": "location", 
    "Where can I find an ATM close to USC Columbia?": "location", 
    "Where can I find an ATM?": "location", 
    "Where can I find my payday schedule online?": "payday", 
    "Where can I find the closest ATM?": "location", 
    "Where can I get some cash": "location", 
    "Where can I get to an ATM?": "location", 
    "Where can I take out money?": "location", 
    "Where can i find a bank near me?": "location", 
    "Where can i find a cash vendor?": "location", 
    "Where can i find an ATM?": "location", 
    "Where can i get money at?": "location", 
    "Where did I last use my credit card?": "txnlist", 
    "Where did I last use my debit card?": "txnlist", 
    "Where did I lose my money": "history", 
    "Where did I purchase the single most expensive item yesterday?": "txnlist", 
    "Where did I spend $100 at in the last month?": "txnlist", 
    "Where did I spend $100?": "txnlist", 
    "Where did I spend $25 dollars yesterday?": "txnlist", 
    "Where did I spend $300 dollars last week?": "txnlist", 
    "Where did I spend $76 2 days ago?": "txnlist", 
    "Where did I spend the least amount of money?": "txnlist", 
    "Where did I spend the most amount of money this year?": "txnlist", 
    "Where did I spend the most amount of money?": "txnlist", 
    "Where did I spend the most money compared to quantity of items?": "txnlist", 
    "Where did I spend yesterday?": "txnlist", 
    "Where did I use my card last?": "txnlist", 
    "Where did I use my credit card last?": "txnlist", 
    "Where did my money go this week?": "history", 
    "Where do I most often spend money?": "history", 
    "Where do I spend most of my money?": "history", 
    "Where do I spend the least amount?": "history", 
    "Where do I spend the most money daily?": "history", 
    "Where do I spend the most money?": "history", 
    "Where have I spent my money": "history", 
    "Where have I spent the most money?": "history", 
    "Where have i been spending money?": "history", 
    "Where have i been spending my money?": "history", 
    "Where is a bank on my way to work?": "location", 
    "Where is an ATM on my way home?": "location", 
    "Where is an ATM?": "location", 
    "Where is bank on my way home?": "location", 
    "Where is my money going?": "history", 
    "Where is my nearest ATM?": "location", 
    "Where is my nearest bank?": "location", 
    "Where is the closest PNC": "location", 
    "Where is the closest ATM": "location", 
    "Where is the closest ATM for Safe Credit Union?": "location", 
    "Where is the closest ATM from me?": "location", 
    "Where is the closest ATM in relation to where I am?": "location", 
    "Where is the closest ATM that does not charge a fee?": "location", 
    "Where is the closest ATM?": "location", 
    "Where is the closest Bank of America?": "location", 
    "Where is the closest Elevations FCU?": "location", 
    "Where is the closest Navy Federal Credit Union to me?": "location", 
    "Where is the closest bank": "location", 
    "Where is the closest bank from where I am on the GPS?": "location", 
    "Where is the closest bank or ATM?": "location", 
    "Where is the closest bank that is open right now?": "location", 
    "Where is the closest bank?": "location", 
    "Where is the closest drive through bank?": "location", 
    "Where is the closest non-charging ATM machine?": "location", 
    "Where is the closest non-surcharge ATM?": "location", 
    "Where is the closest place to make a deposit?": "location", 
    "Where is the closest place to withdrawl cash?": "location", 
    "Where is the most convenient Bank of America atm?": "location", 
    "Where is the nearest ATM based on my location?": "location", 
    "Where is the nearest ATM from my current location?": "location", 
    "Where is the nearest ATM location to me?": "location", 
    "Where is the nearest ATM or bank?": "location", 
    "Where is the nearest ATM?": "location", 
    "Where is the nearest Bank of America?": "location", 
    "Where is the nearest Fifth Third Bank to Center Mall?": "location", 
    "Where is the nearest Wells Fargo to my house?": "location", 
    "Where is the nearest Wells Fargo?": "location", 
    "Where is the nearest atm or bank?": "location", 
    "Where is the nearest bank branch?": "location", 
    "Where is the nearest bank or ATM?": "location", 
    "Where is the nearest bank?": "location", 
    "Where is the nearest drive-through ATM?": "location", 
    "Where is the nearest open bank": "location", 
    "Where was the last place I spent money at today?": "txnlist", 
    "Where's my money gone?": "history", 
    "Where's the closest ATM?": "location", 
    "Where's the closest bank near me?": "location", 
    "Where's the closest financial institution": "location", 
    "Where's the nearest ATM?": "location", 
    "Where's the nearest bank": "location", 
    "Where's the nearest bank?": "location", 
    "Where's the closest regions bank?": "location", 
    "Where's the nearest ATM": "location", 
    "Where's the nearest ATM?": "location", 
    "Where's the nearest bank?": "location", 
    "Which ATM is open near me": "location", 
    "Which bank is closest to me": "location", 
    "Which category do I spend the most money?": "history", 
    "Which job gave me the largest earnings last month?": "income", 
    "Which restaurant do I spend the most amount of money?": "history", 
    "While in Hickory how much money did I spend?": "history", 
    "Why is my account balance so low?": "balance", 
    "Why is my balance so low?": "history", 
    "can i afford to spend $23 on a michael jordan jersey": "spendadvice", 
    "Will $35.00 pay for a dinner for four at Tijuana Flats?": "spendadvice", 
    "Will I be paid this Friday?": "payday", 
    "Will I get paid the last week of December 2016?": "payday", 
    "Will I get paid this week?": "payday", 
    "Will I make over forty thousand dollars this year?": "income", 
    "Will it take a long time for me to get to the nearest ATM": "location", 
    "Will my Bank of America credit card support my purchasing a $699 pair of Manolo Blahnik shoes?": "spendadvice", 
    "Will my paycheck this month be greater than last month?": "income", 
    "Will you transfer funds in the amount of ten dollars from my checking to my savings?": "transfer", 
    "Will you transfer ten dollars from this account to checking?": "transfer", 
    "Wire money between my accounts": "transfer", 
    "Would I be able to pay a $300 laptop charge today?": "spendadvice", 
    "Would I be ok to spend $40 going golfing?": "spendadvice", 
    "Would it be alright for me to spend $75 to get a new stereo?": "spendadvice", 
    "Would you move funds from my savings account into my checking account so that I do not overdraft my account?": "transfer", 
    "Would you please move twenty dollars from my savings account to my checking account?": "transfer", 
    "about how much did I spend when I was in Austin?": "history", 
    "add up deposits from my employer from the last 2 months": "income", 
    "am I near an atm": "location", 
    "am I too poor for this car right now": "spendadvice", 
    "can I afford a car": "spendadvice", 
    "can I afford a movie": "spendadvice", 
    "can I afford this new pair of headphones which are 54 bucks": "balance", 
    "can I afford to buy my specialized bike for 900?": "spendadvice", 
    "can I spend less than 5 dollars to buy a box of cigars": "spendadvice", 
    "can i afford a $300 car payment once a month": "spendadvice", 
    "can i afford a new car?": "spendadvice", 
    "can i afford this book?": "spendadvice", 
    "can i afford this television?": "spendadvice", 
    "can i buy a burger for $3": "spendadvice", 
    "can i buy a new computer?": "spendadvice", 
    "can i buy a television for $150": "spendadvice", 
    "can i buy an xbox one for $200?": "spendadvice", 
    "can i pay my light bill?": "spendadvice", 
    "can you tell me the name of the pizza restaurant I spent 100$ at last week?": "txnlist", 
    "can you transfer ten dollars from my checking to my savings?": "transfer", 
    "closest comerica atm from me": "location", 
    "closest atm": "location", 
    "did I get paid for that job today?": "income", 
    "did I make at least $30,000 last year?": "income", 
    "did I make more money in June 2013 or June 2014?": "income", 
    "did my husband shop at Bass Pro Shop this month?": "txnlist", 
    "did that Amazon payments transfer come through yet?": "income", 
    "display a list of my transactions at Disneyland": "txnlist", 
    "display all transactions by date": "txnlist", 
    "display direct deposits": "txnlist", 
    "display purchases": "txnlist", 
    "display spending history": "history", 
    "do I get my next paycheck this week or next?": "payday", 
    "do I have enough money in my account to go to a movie": "spendadvice", 
    "do I have enough money to buy a Tesla": "spendadvice", 
    "do I have the money for this car": "spendadvice", 
    "do i have enough to buy a $100 video game": "spendadvice", 
    "does this car cost too much for me right now": "spendadvice", 
    "find all the times i spent $500 or more in one shot": "txnlist", 
    "find me the closest bank with an atm": "location", 
    "find me the nearest atm to my location": "location", 
    "find the closest ATM right now": "location", 
    "find the nearest atm or bank": "location", 
    "give me the bottom line": "balance", 
    "has Amazon paid me yet": "payday", 
    "have I been paid this week": "payday", 
    "have I been paid yet": "payday", 
    "have I spent over $1,000 at the Loft this year?": "history", 
    "have i spent more that 30 dollars at movie theaters in the last month": "history", 
    "how broke am I today?": "balance", 
    "how broke am I?": "balance", 
    "how close is the nearest bank or atm": "location", 
    "how do i get to the nearest bank or atm": "location", 
    "how far away is the closest ATM": "location", 
    "how far is the closest bank with an atm": "location", 
    "how much did i spend when i was in kentucky": "history", 
    "how long would it take to walk to the nearest bank": "location", 
    "how many charges do i have for new york city": "txnlist", 
    "how much do i have": "balance", 
    "how much am I earning per hour this year": "income", 
    "how much can i spend on clothing": "spendadvice", 
    "how much can i spend this month on clothing": "spendadvice", 
    "how much did I earn last year": "income", 
    "how much did I earn per hour last year": "income", 
    "how much did I spend and where today?": "txnlist", 
    "how much did I spend at the appliance store": "history", 
    "how much did I spend at arby's?": "history", 
    "how much did I spend eating out": "history", 
    "how much did I spend in Memphis?": "history", 
    "how much did I spend in Peru": "history", 
    "how much did I spend in Texas visiting my mother this summer?": "history", 
    "how much did I spend in the last 2 months": "history", 
    "how much did I spend on groceries": "history", 
    "how much did I spend yesterday?": "history", 
    "how much did amazon deposit last month": "payday", 
    "how much did i deposit in my bank account over the last year?": "income", 
    "how much did i make from work last month": "income", 
    "how much did i make last month?": "income", 
    "how much did i spend at publix yesterday": "history", 
    "how much did i spend at starbucks last year": "history", 
    "how much did i spend in Kentucky": "history", 
    "how much did i spend in atlanta": "history", 
    "how much did i spend in austin?": "history", 
    "how much did i spend in florida": "history", 
    "how much did i spend in miami": "history", 
    "how much did i spend in san diego": "history", 
    "how much did i spend in spain": "history", 
    "how much did i spend in tampa": "history", 
    "how much did i spend on groceries last week": "history", 
    "how much did i spend on shoes last month": "history", 
    "how much did i spend on vacation to spain last june": "history", 
    "how much did i spent at the bar last night": "history", 
    "how much did my bank account increase last friday?": "income", 
    "how much did my trip to canada cost me": "history", 
    "how much did spend at the grocery store?": "history", 
    "how much do i have available": "balance", 
    "how much do i have in my account": "balance", 
    "how much do i have left in my checking account?": "balance", 
    "how much do i make per day?": "income", 
    "how much do i spend at Chipotle": "history", 
    "how much dough did I rake in last year?": "income", 
    "how much has been deposited by moosejaw in the last 6 months": "income", 
    "how much has been direct deposited in the last 3 months": "income", 
    "how much have I deposited this month": "income", 
    "how much have I earned so far this year": "income", 
    "how much have I spent this month": "history", 
    "how much have i spent on fuel at gas stations in the last year": "history", 
    "how much is in my bank account?": "balance", 
    "how much is my available account balance": "balance", 
    "how much is my current account balance": "balance", 
    "how much is my next paycheck going to be?": "income", 
    "how much money did I earn this week?": "income", 
    "how much money did I make last month": "income", 
    "how much money did I make last month?": "income", 
    "how much money did I make on my last paycheck?": "income", 
    "how much money did I make this month": "income", 
    "how much money did I make yesterday?": "income", 
    "how much money did I spend in Austin?": "history", 
    "how much money did I spend in Chile": "history", 
    "how much money did I spend in Las Vegas last year": "history", 
    "how much money did I spend on books this week?": "history", 
    "how much money did i make from etsy in 2015?": "income", 
    "how much money did i make last year": "income", 
    "how much money do I have": "balance", 
    "how much money do I have in my saving account?": "balance", 
    "how much money do I have to spend": "balance", 
    "how much money do i have in my PNC checking account": "balance", 
    "how much money do i have in my bank account?": "balance", 
    "how much money do i have in my wells fargo account?": "balance", 
    "how much money do i have?": "balance", 
    "how much money have I deposited in my business account in the last year": "income", 
    "how much money have I earned this month": "income", 
    "how much money have I spent on toys this month?": "history", 
    "how much money have i deposited from my clients": "income", 
    "how much money have i spent at grocery stores this month": "history", 
    "how much money have i spent at costco in june": "history", 
    "how much money have i spent in Chicago": "history", 
    "how much money have i spent on food in the last month": "history", 
    "how much money is currently in my account": "balance", 
    "how much money is in my account": "balance", 
    "how much money is in my account?": "balance", 
    "how much money is in my checking account?": "balance", 
    "how much money was spent in philadelphia": "history", 
    "how much money will i make from patagonia in 2016?": "income", 
    "how much per hour did i make last month?": "income", 
    "how much per minute do i make?": "income", 
    "how much cash did I spend in orlando": "history", 
    "how much was my last payment?": "income", 
    "how much was my last transaction": "txnlist", 
    "how much was my previous paycheck?": "income", 
    "how much was my pay from subway last month": "income", 
    "what were my paydays in June": "payday", 
    "how much was on my last paycheck": "income", 
    "how much was spent in Tunica Casino?": "history", 
    "how much was that Amazon.com order I made on the 5th of this month?": "history", 
    "how much was the last pay": "income", 
    "how much were those plane tickets to Rio?": "history", 
    "how rich am I today?": "balance", 
    "i need to a ATM close by.": "location", 
    "i need to see a list of what i bought last month online": "txnlist", 
    "i need to see a list of what i spent at chipotle last year": "txnlist", 
    "i need to transfer money between my accounts": "transfer", 
    "i want an Apple Watch, how much money do I have?": "balance", 
    "if I go to a movie is there enough money in my checking account to buy a ticket": "spendadvice", 
    "if i spend $200 on clothes will there be enough to pay my bills": "spendadvice", 
    "in the last 2 months how much did I spend": "history", 
    "in the last 3 months how much money deposited came from the law firm": "income", 
    "in the last 3 months how much money have i desposited from costco": "income", 
    "is the payment from steelcase coming tomorrow?": "payday", 
    "is there a bank close by?": "location", 
    "is there an atm close to me": "location", 
    "is there enough in my account to cover a $20 dinner": "spendadvice", 
    "is there enough money in my bank account to purchase an iPad": "spendadvice", 
    "list my transactions over $100": "txnlist", 
    "list of deposits made by amazon last year": "txnlist", 
    "list of recent bank transactions": "txnlist", 
    "list of transactions at publix for the last 30 days": "txnlist", 
    "make a transfer to my other account": "transfer", 
    "money spent at arena": "history", 
    "move $10000 from vacation to checking": "transfer", 
    "move $50 from college fund to checking": "transfer", 
    "move 10 percent of my savings to my checking account": "transfer", 
    "move 30 from my checking account over to savings": "transfer", 
    "move 75 from checking to savings": "transfer", 
    "move a hundred dollars from savings to checking": "transfer", 
    "move fifty from savings to checking": "transfer", 
    "move money from savings to checking": "transfer", 
    "move two hundred dollars from my checking account to my savings account": "transfer", 
    "nearest atm": "location", 
    "nearest bank": "location", 
    "other than recurring bills where have i spent most of my money": "history", 
    "pay from uber last month": "income", 
    "pay from google that was deposited into my account last year": "payday", 
    "please display a list of my transactions by date": "txnlist", 
    "please find the nearest bank": "location", 
    "please show me the list of my leisure transactions": "txnlist", 
    "please transfer money from my Bank of America account to my Scottrade account": "transfer", 
    "please transfer money to my other account.": "transfer", 
    "please transfer this money from one account to the other.": "transfer", 
    "present me with a list of my transactions sorted by cost for the last 2 weeks": "txnlist", 
    "recent transactions from my checking account": "txnlist", 
    "remove 350 dollars from checking and deposit them into my savings account": "transfer", 
    "send seventy five dollars from my savings to my checking": "transfer", 
    "set up an automatic transfer of $25 each week from my savings account to my checking account": "transfer", 
    "shift monies from checking to savings": "transfer", 
    "show a list of my transactions filtered by cost": "txnlist", 
    "list all transactions by type": "txnlist", 
    "show me a list of my most recent ATM withdrawls": "txnlist", 
    "show me a list of my recent banking transactions": "txnlist", 
    "show me a list of my recent pin based transactions": "txnlist", 
    "show me a list of my recent transactions": "txnlist", 
    "show me a list of my recent transactions over $50": "txnlist", 
    "show me a list of my transactions by cost": "txnlist", 
    "show me a list of my transactions for the last 10 days": "txnlist", 
    "show me a list of recent transactions": "txnlist", 
    "show me a list of the transactions at starbucks last year": "txnlist", 
    "take 400 dollars from savings and deposit it into checking": "transfer",
    "show me all incoming money": "income", 
    "show me my bank statement": "txnlist", 
    "show me my current account summary": "txnlist", 
    "show me my history for the last 3 months": "history", 
    "show me my last 15 transactions": "txnlist", 
    "show my spending history": "history", 
    "show purchases": "txnlist", 
    "sort transactions by amount": "txnlist", 
    "spending history at rhode island": "history", 
    "spending for travel": "history", 
    "take 80 out of savings and put it in checking": "transfer", 
    "tell me my current account balance": "balance", 
    "tomorrow, transfer $150 from checking to savings": "transfer", 
    "total USD I spent in Germany?": "history", 
    "total me out": "balance", 
    "transaction list on checking account": "txnlist", 
    "transfer $100 from checking to savings": "transfer", 
    "transfer $120 from checking to loan 3": "transfer", 
    "transfer $13 from my savings account to my checking account": "transfer", 
    "transfer $500 from checking to savings": "transfer", 
    "transfer $800 from my checking account to my savings account": "transfer", 
    "transfer 25 to my savings account": "transfer", 
    "transfer cash from savings to checking": "transfer", 
    "transfer eighty seven dollars and fifty two cents from my savings account to my checking account": "transfer", 
    "transfer fifty dollars from checking to savings": "transfer", 
    "transfer from checking to savings $260": "transfer", 
    "transfer money from my first account": "transfer", 
    "transfer money out of my first account": "transfer", 
    "transfer money to my second account": "transfer", 
    "transfer ten dollars from checking to business": "transfer", 
    "transfer ten dollars from checking to savings": "transfer", 
    "transfer ten dollars from my checking account to my savings account": "transfer", 
    "transfer twenty dollars from savings to checking": "transfer", 
    "transfer twenty dollars from savings to credit card": "transfer", 
    "when is my next expected paycheck": "payday", 
    "what are my recent checking account transactions": "txnlist", 
    "what are this month's transactions": "txnlist", 
    "what date was my last payday?": "payday", 
    "what did I make yesterday?": "income", 
    "what did I spend and where did I spend it": "history", 
    "what do I have as a balance": "balance", 
    "what do I have in my account": "balance", 
    "what do i have in my account?": "balance", 
    "what do my finances look like, will i have enough to buy my bike?": "spendadvice", 
    "what have i spent my money on in the past month": "history", 
    "what have my deposits been over the last month been?": "income", 
    "what is my account balance": "balance", 
    "what is my account balance?": "balance", 
    "what is my available account balance": "balance", 
    "what is my available account balance?": "balance", 
    "what is my average balance on my checking account ?": "balance", 
    "what is my balance": "balance", 
    "what is my bank account balance": "balance", 
    "what is my bank balance": "balance", 
    "what is my checking account balance?": "balance", 
    "what is my checking balanace?": "balance", 
    "what is my current account balance": "balance", 
    "what is my current account balance?": "balance", 
    "what is my current balance": "balance", 
    "what is my income for this year": "income", 
    "what is my last transaction": "txnlist", 
    "what is my savings account balance?": "balance", 
    "what is my spending history for this week?": "history", 
    "what is my total balance to date": "balance", 
    "what is the balance in my savings account": "balance", 
    "what is the balance of my account?": "balance", 
    "what is the breakdown of my monthly income by source": "income", 
    "what is the grand total of withdrawals at Tiffany's?": "history", 
    "what amount did i spend in austin texas": "history", 
    "what did i spend when i was in key west": "history", 
    "what was my checking balance yesterday at 10 AM?": "balance", 
    "what was my income for the first week of this year": "income", 
    "what was my income last week": "income", 
    "what was my last five transaction": "txnlist", 
    "what was my total deposits for the last 2 months": "income", 
    "what was my total expenditure in Germany?": "history", 
    "what was the amount of my last paycheck times 50": "income", 
    "i spent how much when i was in seattle": "history", 
    "what was the total amount of money I spent in Laos": "history", 
    "what was the total amount of purchases in Tokyo?": "history", 
    "what was the total spent in greece": "history", 
    "what were my earnings for July": "income", 
    "what were my transactions last week?": "txnlist", 
    "what were the last 5 transactions at Opry Mills Mall?": "txnlist", 
    "what's left": "balance", 
    "what's my annual after tax income?": "income", 
    "what's my balance": "balance", 
    "what's my current checking account balance": "balance", 
    "what's the balance in my money market account right now": "balance", 
    "what's my balance?": "balance", 
    "when I was in Thailand, how much money did I spend": "history", 
    "when am I next paid": "payday", 
    "when is my next expected deposit from my employer": "payday", 
    "when is the first payday in august?": "payday", 
    "when is the next month where i'll have three paydays?": "payday", 
    "when was I last paid": "payday", 
    "when was my last pay": "payday", 
    "when was my last pay deposit": "payday", 
    "when was my paycheck deposited the week before christmas": "payday", 
    "when will i get paid again from my employer?": "payday", 
    "when's my next payday?": "payday", 
    "where did I spend the majority of my money in the last 2 months": "history", 
    "where is an atm": "location", 
    "where is the bank": "location", 
    "where is the closest key bank atm": "location", 
    "where is the closest atm to 95th and Western in Chicago": "location", 
    "where is the closest atm to me": "location", 
    "where is the closest place to check my balance?": "location", 
    "where is the nearest ATM": "location", 
    "where is the nearest bank or atm": "location", 
    "where is your nearest location": "location", 
    "will i get another paycheck before christmas": "payday"
}
